{
    "00-warning": "Remotive main domain moved to remotive.com ! Please make your API calls on remotive.com/api/remote-jobs instead of remotive.io now ;) Legacy endpoint remotive.io/api/remote-jobs will be terminated in June 2022. Thank you!",
    "0-legal-notice": "Legal warning - Hey, thanks for using Remotive's API, we appreciate it! Please note that API documentation and access is granted so that developers can share our jobs further. Please do not submit Remotive jobs to third Party websites, including but not limited to: Jooble, Neuvoo, Google Jobs, LinkedIn Jobs. Please link back to the URL found on Remotive AND mention Remotive as a source in order to Remotive to get traffic from your listing. If you don't do that, we'll terminate your API access, sorry! Jobs displayed are delayed by 24 hours, the goal being that jobs are attributed to Remotive on various platforms. Displaying our jobs in order to collect signups/email addresses to show a listing constitutes a breach of our terms of services. We offer a private, paid-for API, please email us at hello(at)remotive(dot)io for more information (starting budget is $5k/mo). Please find out terms of services on https://remotive.com/api-documentation. Please note that there is absolutely no need to request Remotive Job data too frequently. Typically, you only need to GET Remotive job data through this API a couple of times a day (we advise max. 4 times a day). Our data is not changing much faster than that anyway. Note that excessive requests will be blocked. Many thanks (Rodolphe & the Remotive team!)",
    "job-count": 10,
    "jobs": [
    {
    "id": 1928740,
    "url": "https://remotive.com/remote-jobs/customer-support/product-specialist-1928740",
    "title": "Product Specialist",
    "company_name": "Avery Dennison",
    "company_logo": "https://remotive.com/job/1928740/logo",
    "category": "Customer Service",
    "tags": [
    "technical support",
    "troubleshooting"
    ],
    "job_type": "full_time",
    "publication_date": "2024-08-07T14:50:45",
    "candidate_required_location": "Canada",
    "salary": "",
    "description": "<br><br><div class=\"h3\">Company Description</div><p><strong>Avery Dennison Corporation (NYSE: AVY) is a global materials science and digital identification solutions company that provides a wide range of branding and information solutions that optimize labor and supply chain efficiency, reduce waste, advance sustainability, circularity and transparency, and better connect brands and consumers. Our products and solutions include labeling and functional materials, radio frequency identification (RFID) inlays and tags, software applications that connect the physical and digital, and a variety of products and solutions that enhance branded packaging and carry or display information that improves the customer experience. Serving an array of industries worldwide — including home and personal care, apparel, general retail, e-commerce, logistics, food and grocery, pharmaceuticals and automotive — we employ approximately 34,000 employees in more than 50 countries. Our reported sales in 2023 were $8.4 billion. Learn more at <a href=\"http://www.averydennison.com/\" rel=\"nofollow\">www.averydennison.com</a>.</strong></p><br><br><div class=\"h3\">Job Description</div><p>The Product Specialist provides second level technical support for users of Avery Dennison applications that are used in a broad range of industries.  The Product Specialist handles issues escalated from the first level support team and the person in this position interfaces with customers and solves problems using phone, email, and chat portals. The Product Specialist must have in-depth product expertise and advanced technical troubleshooting issues to solve complex customer issues within our service level agreements. In our fast-paced environment, support is provided in a professional, efficient, and precise manner.  Our customers have high expectations for quick and accurate help.</p><ul style=\"\"><li style=\"\">Configure client data (across multiple complex systems)</li><li style=\"\">Strong mastering of the product features</li><li style=\"\">Strong written and verbal communication skills</li><li style=\"\">Continuously expand knowledge of our product line</li><li style=\"\">Always deliver exceptional customer service</li><li style=\"\">Answer all questions and address all concerns that the customer may have</li><li style=\"\">Help customers determine which product is the right choice for them</li><li style=\"\">Demonstrate product functionality accurately and completely</li><li style=\"\">Accurately communicate all technical specifications</li><li style=\"\">Follow up with potential customers</li><li style=\"\">Offer related products and services to new customers</li><li style=\"\">Management of ongoing customer activity/projects</li><li style=\"\">Provide training on our products both internally and to customers</li><li style=\"\">Perform customer hardware troubleshooting</li><li style=\"\">Assist the customer support team with complex/escalated tickets</li><li style=\"\">Management of our technical documentation (Help Center) including writing new articles, editing existing articles </li></ul><br><br><div class=\"h3\">Qualifications</div><ul style=\"\"><li style=\"\">Bachelor’s degree or equivalent preferred.</li><li style=\"\">0 - 3 years technical experience preferred.</li><li style=\"\">Knowledge of Industry, products and applications preferred.</li><li style=\"\">Related product knowledge preferred.</li><li style=\"\">Good written, verbal and telephone communication skills.</li><li style=\"\">Good customer service skills.</li><li style=\"\">Strong attention to detail &amp; organizational skills.</li><li style=\"\">Strong technical aptitude.</li><li style=\"\">Must be able to work on call and support on some weekends</li></ul><br><br><div class=\"h3\">Additional Information</div><p>Management reserves the right to revise, change or modify the duties and responsibilities of this position at any time to meet business and organizational needs. This position description may not list all duties for this position. The incumbent in this position may be asked to perform other duties. This position description is not a contract for employment and either the incumbent or the company may terminate employment at any time, for any reason.</p><img src=\"https://remotive.com/job/track/1928740/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1928741,
    "url": "https://remotive.com/remote-jobs/customer-support/german-speaking-customer-advisor-1928741",
    "title": "German Speaking Customer Advisor",
    "company_name": "Cross Border Talents",
    "company_logo": "https://remotive.com/job/1928741/logo",
    "category": "Customer Service",
    "tags": [
    "time management"
    ],
    "job_type": "part_time",
    "publication_date": "2024-08-07T12:50:54",
    "candidate_required_location": "Greece",
    "salary": "attractive salary package",
    "description": "<p>We are a leading e-commerce company dedicated to providing exceptional service to our global customers. As part of our commitment to enhancing customer satisfaction, we are expanding our team to include a motivated and customer-oriented German Speaking Customer Advisor. This part-time, fully remote position offers flexible working hours and is ideal for those based in Greece who are passionate about delivering high-quality customer service.</p> <p><strong>Role Overview:</strong></p> <p>As a Remote Part-Time German Speaking Customer Advisor, you will be the primary contact for our German-speaking customers. Your role will involve providing support and resolving customer inquiries through email and chat. You will play a crucial part in maintaining customer satisfaction and contributing to the overall success of our customer service team.</p> <p><strong>Key Duties:</strong></p> <ul style=\"\"><li style=\"\"><strong>Customer Interaction:</strong> Engage with customers via email and chat to address their queries, concerns, and feedback in a professional and friendly manner.</li><li style=\"\"><strong>Problem Resolution:</strong> Identify customer issues, provide appropriate solutions, and follow up to ensure complete resolution and customer satisfaction.</li><li style=\"\"><strong>Product Knowledge:</strong> Develop a comprehensive understanding of our products and services to assist customers accurately and effectively.</li><li style=\"\"><strong>Documentation:</strong> Maintain detailed and accurate records of customer interactions and transactions.</li><li style=\"\"><strong>Collaboration:</strong> Work closely with other team members and departments to resolve complex issues and improve customer service processes.</li><li style=\"\"><strong>Performance Targets:</strong> Strive to meet and exceed individual and team performance goals, contributing to the overall efficiency of the customer service department.</li><li style=\"\"><strong>Continuous Learning:</strong> Participate in training sessions to stay updated on new products, services, and customer service techniques.</li></ul> <p><strong>Qualifications and Skills:</strong></p> <ul style=\"\"><li style=\"\"><strong>Language Proficiency:</strong> Native-level fluency in German and strong command of English, both written and spoken.</li><li style=\"\"><strong>Communication Skills:</strong> Exceptional communication skills with a customer-centric approach.</li><li style=\"\"><strong>Problem-solving Ability:</strong> Strong analytical skills to diagnose issues and find effective solutions.</li><li style=\"\"><strong>Team Player:</strong> Ability to work independently and collaboratively within a remote team environment.</li><li style=\"\"><strong>Attention to Detail:</strong> High level of accuracy and attention to detail in all tasks.</li><li style=\"\"><strong>Time Management:</strong> Excellent organizational and time-management skills to handle multiple tasks efficiently.</li><li style=\"\"><strong>Experience:</strong> Prior experience in customer service is beneficial but not required; a positive attitude and willingness to learn are highly valued.</li><li style=\"\"><strong>Technical Skills:</strong> Basic proficiency with computer systems and familiarity with e-commerce platforms is advantageous.</li></ul> <p><strong>Working Hours:</strong></p> <ul style=\"\"><li style=\"\">Part-time options available: 4 or 6 hours per day.</li></ul> <p><strong>Employee Benefits:</strong></p> <ul style=\"\"><li style=\"\"><strong>Competitive Salary:</strong> Attractive salary package that reflects your skills and experience.</li><li style=\"\"><strong>Health and Life Insurance:</strong> Comprehensive health and life insurance plans to ensure your well-being.</li><li style=\"\"><strong>Career Growth:</strong> Opportunities for professional development and career advancement within the company.</li><li style=\"\"><strong>Remote Work Setup:</strong> All necessary equipment will be provided by the company to support your remote work environment.</li><li style=\"\"><strong>Supportive Work Culture:</strong> Work in a friendly, inclusive, and supportive environment with a diverse team.</li><li style=\"\"><strong>Training Programs:</strong> Access to continuous training and development resources to help you grow in your role.</li></ul> <p><strong>Why Join Us:</strong></p> <ul style=\"\"><li style=\"\"><strong>Innovation and Growth:</strong> Be part of a forward-thinking company at the forefront of the e-commerce industry.</li><li style=\"\"><strong>Diverse and Inclusive Environment:</strong> Work with a multicultural team from various parts of the world.</li><li style=\"\"><strong>Work-Life Balance:</strong> Enjoy the flexibility of part-time remote work that promotes a healthy work-life balance.</li><li style=\"\"><strong>Comprehensive Benefits:</strong> Benefit from extensive health and life insurance, career development opportunities, and many other perks.</li><li style=\"\"><strong>Continuous Learning:</strong> Engage in ongoing training programs to enhance your skills and stay current in the industry.</li></ul> <p>We are looking for proactive and enthusiastic individuals who are passionate about delivering exceptional customer service and eager to grow with us. If you are ready to take on a rewarding role in the e-commerce industry, we want to hear from you. Apply today to join our dynamic team and make a significant impact!</p><img src=\"https://remotive.com/job/track/1928741/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1928742,
    "url": "https://remotive.com/remote-jobs/customer-support/customer-success-manager-1928742",
    "title": "Customer Success Manager",
    "company_name": "Agency Services",
    "company_logo": "https://remotive.com/job/1928742/logo",
    "category": "Customer Service",
    "tags": [
    "digital marketing"
    ],
    "job_type": "contract",
    "publication_date": "2024-08-07T04:50:24",
    "candidate_required_location": "Colombia",
    "salary": "",
    "description": "<p>Agency Services, a marketing and advertising company specializing in lead generation and digital marketing, is seeking a Customer Success Manager to join our team. In this role, you will be responsible for ensuring the success and satisfaction of our clients using our digital marketing agency app.</p><p>As the Customer Success Manager, you will be the main point of contact for our clients, providing support, guidance, and training as they navigate and utilize our web application. You will work closely with clients to understand their unique needs and business goals, and you will be responsible for developing and implementing strategies to help them maximize the value and effectiveness of our lead generation solution.</p><p>Your primary focus will be on ensuring client retention and driving customer satisfaction. You will work collaboratively with our sales, marketing, and development teams to address client needs, resolve issues, and provide recommendations for product enhancements or improvements.</p><div class=\"h3\">Responsibilities</div><ul style=\"\"> <li style=\"\">Serve as the main point of contact for clients using our digital marketing agency application</li> <li style=\"\">Build strong relationships with clients, providing ongoing support and ensuring their success</li> <li style=\"\">Understand client needs and business goals, and develop strategies to help them achieve success using our solution</li> <li style=\"\">Provide training and assistance to clients, helping them effectively utilize our web application</li> <li style=\"\">Monitor client usage and success metrics, identifying areas for improvement or optimization</li> <li style=\"\">Proactively identify and address client issues and concerns, ensuring timely resolution</li> <li style=\"\">Collaborate with sales, marketing, and development teams to communicate client feedback and contribute to product enhancements</li> </ul><p><strong>Requirements</strong></p><ul style=\"\"> <li style=\"\">Prior experience in a customer success or account management role, preferably in the digital marketing or software industry</li> <li style=\"\">Strong understanding of digital marketing and lead generation concepts</li> <li style=\"\">Excellent communication and interpersonal skills, with the ability to build strong client relationships and effectively communicate complex concepts</li> <li style=\"\">Experience providing training and support to clients</li> <li style=\"\">Proactive and problem-solving mindset, with the ability to anticipate and address client needs</li> <li style=\"\">Highly organized, with strong attention to detail and the ability to manage multiple client accounts</li> <li style=\"\">Ability to thrive in a fast-paced, deadline-driven environment</li> <li style=\"\">Familiarity with lead generation web applications or CRM systems is a plus</li> <li style=\"\">Bachelor's degree in Marketing, Business, or a related field</li> </ul><p><strong>Benefits</strong></p><ul style=\"\"> <li style=\"\">Work as an independent contractor (1099) with tons of flexibility </li> <li style=\"\">Enjoy the freedom to work from anywhere you choose.</li> <li style=\"\">Determine your own schedule and have a better work-life balance.</li> <li style=\"\">Gain experience in digital PR and media pitching across diverse industries.</li> <li style=\"\">Access to a dynamic team for collaboration and support.</li> </ul><br><br><div class=\"h2\">About the company</div><br><p>Delivering results since 2000</p><img src=\"https://remotive.com/job/track/1928742/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1928743,
    "url": "https://remotive.com/remote-jobs/customer-support/team-lead-americas-client-success-1928743",
    "title": "Team Lead Americas, Client Success",
    "company_name": "Flywire",
    "company_logo": "https://remotive.com/job/1928743/logo",
    "category": "Customer Service",
    "tags": [
    "account management"
    ],
    "job_type": "full_time",
    "publication_date": "2024-08-07T00:51:11",
    "candidate_required_location": "Americas",
    "salary": "competitive compensation, including restricted stock units",
    "description": "<br><br><div class=\"h3\">Company Description</div><p><strong>Are you ready to trade your job for a journey? Become a FlyMate!</strong><br>\n<br>\nPassion, excitement &amp; global collaboration are all core to what it means to be a FlyMate. At Flywire, we’re on a mission to deliver the world’s most important and complex payments. We use our Flywire Advantage - the combination of our next-gen payments platform, proprietary payment network and vertical specific software, to help our clients get paid, and help their customers pay with ease - no matter where they are in the world.<br>\n<br>\nWhat more do we need to truly be unstoppable? Perhaps, that is you! </p><p><br>\n<strong>Who we are: </strong></p><p>Flywire is a global payments enablement and software company, delivering high-stakes, high-value payments across the global education, healthcare, travel and B2B industries.<br>\n<br>\nToday, we’ve digitized payments for more than 4,000+ global clients in more than 140 currencies across 240 countries and territories around the world.  And, we’re just getting started!</p><p>With over 1,200+ global FlyMates, representing more than 40 nationalities, and in 12 offices world-wide, we’re looking for FlyMates to join the next stage of our journey as we continue to grow.</p><br><br><div class=\"h3\">Job Description</div><p><strong>The Opportunity:  </strong></p><p>We, at Flywire, are seeking a Team Lead Americas, Client Success Lead for Flywire’s EDU vertical. In this role, you will have a strategic focus centred around the provision of exceptional value-add support services, primarily in the form of training and end-user communication optimisation for our existing client base. You will also coordinate the management of ~900 group-managed accounts through scalable, effective engagements. </p><p>As a senior member of the Client Operations team, you will work closely with the Global Manager of Client Success, Snr. Director of Client Operations and other Team Leads to inform our collective approach and to challenge existing processes; particularly with how Client Success operates within the wider EDU function.  </p><p>This team is quickly evolving and is flexible to the needs of the business which means this role must work in step with Client Analysis, Relationship Management, Sales, Client &amp; Payment Experience, Marketing &amp; Implementation to mature into the most effective version of itself in providing meaningful, data-led engagement to enhance client (and their payers) experiences. </p><p>This is a rare opportunity to help shape the path for client engagement at Flywire, in this role you will:</p><ul style=\"\"><li style=\"\">Define and execute a Client Success strategy across the region, to maximise leads and engagement</li><li style=\"\">Manage and coordinate a regional team with sensitivity, pragmatism, enthusiasm &amp; flexibility</li><li style=\"\">Empower &amp; coach your team to provide scalable, effective support to our clients</li><li style=\"\">Utilise data insights to inform, formulate and drive strategy(s) for client engagement &amp; change management</li><li style=\"\">Be both a coordinator and a do-er, you’re in the game, not on the sidelines</li><li style=\"\">Manage a portfolio of accounts, actively seeking opportunity to positively influence revenue</li><li style=\"\">Be able to manage your own daily operations while maintaining overall team productivity</li><li style=\"\">Identify and project manage process improvements &amp; initiatives for optimisation</li><li style=\"\">Constantly assess team performance &amp; outputs against pre-determined KPIs</li><li style=\"\">Be able to effectively prioritise, act with a sense of urgency and delegate effectively</li><li style=\"\">Nurture collaborative relationships with key internal stakeholders, to maximise opportunity and outputs</li><li style=\"\">Understand the Flywire product suite, tools, and workflows</li></ul><br><br><div class=\"h3\">Qualifications</div><p><strong>Here’s What We’re Looking For:   </strong></p><ul style=\"\"><li style=\"\">6+ years of experience in customer/client support, account management, and/or project management preferred. </li><li style=\"\">Experience as a manager in Higher Education, Payments, Banking &amp; Finance, and/or Technology Platforms (Beneficial)</li><li style=\"\">Experience leading a team and/or coaching key stakeholders to benefit both the individual and the group</li><li style=\"\">Be accountable, proactive &amp; persistent. Always</li><li style=\"\">Ability to disrupt the status quo and deliver change</li><li style=\"\">Strong problem solving and project management skills with attention to detail</li><li style=\"\">Time management, organisational and analytical skills</li><li style=\"\">Excellent written and verbal communication and presentation skills </li><li style=\"\">Takes initiative, willing to engage internally and externally and think outside the box</li><li style=\"\">Fluency in English and Spanish is required (C1 proficiency or equivalent)</li></ul><p><strong>Technologies We Use:</strong></p><ul style=\"\"><li style=\"\">Looker</li><li style=\"\">Smartsheet</li><li style=\"\">Salesforce</li><li style=\"\">Zendesk</li></ul><br><br><div class=\"h3\">Additional Information</div><p><strong>What We Offer:</strong></p><ul style=\"\"><li style=\"\">Competitive compensation, including Restricted Stock Units </li><li style=\"\">Employee Stock Purchase Plan (ESPP)</li><li style=\"\">Flying Start - Our immersive Global Induction Program (Meet our Execs &amp; Global Teams)</li><li style=\"\">Work with brilliant people that will keep you on your toes, learn more about their journeys by checking out #InsideFlywire on social media</li><li style=\"\">Dynamic &amp; Global Team (we have been collaborating virtually for years!)</li><li style=\"\">Wellbeing Programs (Mental Health, Wellness, Yoga/Pilates/HIIT Classes) with Global FlyMates </li><li style=\"\">Be a meaningful part in our success - every FlyMate makes an impact</li><li style=\"\">Competitive time off including FlyBetter Days to volunteer in a cause you believe in and Digital Disconnect Days!</li><li style=\"\">Great Talent &amp; Development Programs (Managers Taking Flight – for new or aspiring managers!)</li></ul><p><br>\n<strong>Submit today and get started!</strong></p><p>We are excited to get to know you! Throughout our process you can expect to meet with different FlyMates including the Hiring Manager, Peers on the team, the VP of the department, and a skills assessment. Your Talent Acquisition Partner will walk you through the steps and be your “go-to” person for any questions.</p><p><em>Flywire is an equal opportunity employer. With over 40 nationalities across 14 different offices diversity, gender equality, and inclusion are at the core of our people agenda. We believe our FlyMates are our greatest asset, and we’re excited to watch our unique culture evolve with each new hire.</em></p><img src=\"https://remotive.com/job/track/1928743/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1928744,
    "url": "https://remotive.com/remote-jobs/customer-support/dutch-speaking-customer-advisor-1928744",
    "title": "Dutch Speaking Customer Advisor",
    "company_name": "Cross Border Talents",
    "company_logo": "https://remotive.com/job/1928744/logo",
    "category": "Customer Service",
    "tags": [
    "chat",
    "insurance"
    ],
    "job_type": "full_time",
    "publication_date": "2024-08-06T22:50:03",
    "candidate_required_location": "Portugal",
    "salary": "competitive salary",
    "description": "<p>Are you fluent in Dutch and ready to immerse yourself in the world of customer service? Join us as a Dutch-Speaking Customer Advisor in Portugal, where your language skills will be the key to providing outstanding support to our valued customers. This unique remote opportunity allows you to enjoy the beauty of Portugal while working from the comfort of your home. Whether you're a seasoned professional or starting your career, this role offers competitive compensation, health and life insurance benefits, and a comprehensive relocation package for those looking to experience the charms of Lisbon. Prior experience is not necessary, and we welcome individuals passionate about delivering exceptional customer experiences.</p> <p><strong>About Us:</strong></p> <p>At the forefront of the e-commerce industry, we are committed to providing top-notch customer service to our global clientele. In Portugal, we've created a dynamic and inclusive team that thrives on collaboration and innovation. As a Dutch-Speaking Customer Advisor, you'll play a pivotal role in ensuring customer satisfaction and contributing to our success in the competitive world of e-commerce.</p> <p><strong>Position Overview:</strong></p> <p>As a Dutch-Speaking Customer Advisor, you'll be the bridge between our customers and the exciting offerings of our e-commerce platform. Your proficiency in Dutch will be essential in providing personalized and effective support.</p> <p><strong>Key Responsibilities:</strong></p> <ul style=\"\"><li style=\"\"><strong>Customer Support:</strong> Engage with Dutch-speaking customers through various channels, including phone, email, and chat, addressing inquiries and providing solutions with a friendly and helpful demeanor.</li><li style=\"\"><strong>Language Proficiency:</strong> Leverage your Dutch language skills to communicate effectively and empathetically with customers, ensuring a positive and tailored experience.</li><li style=\"\"><strong>Remote Work in Portugal:</strong> Enjoy the flexibility of remote work, allowing you to live anywhere in Portugal while still contributing to our dynamic team.</li><li style=\"\"><strong>Relocation Package:</strong> For those coming from abroad, take advantage of our comprehensive relocation package, including flight tickets to Lisbon and accommodation support, allowing you to experience the beauty of Portugal.</li><li style=\"\"><strong>Collaboration:</strong> Work collaboratively with our diverse team, sharing insights and contributing to a positive working environment.</li></ul> <p><strong>Qualifications:</strong></p> <ul style=\"\"><li style=\"\"><strong>Fluency in Dutch:</strong> Mastery of both spoken and written Dutch is essential for effective communication with Dutch-speaking customers.</li><li style=\"\"><strong>Customer-Centric Approach:</strong> Strong communication skills with a customer-centric approach, ensuring a positive and seamless customer experience.</li><li style=\"\"><strong>Tech-Savvy:</strong> Comfortable navigating various online platforms and tools, with the ability to quickly adapt to new technologies utilized for customer support.</li><li style=\"\"><strong>Problem-Solving Skills:</strong> Exhibit strong problem-solving skills, resolving customer concerns efficiently and professionally.</li></ul> <p><strong>Perks:</strong></p> <ul style=\"\"><li style=\"\"><strong>Remote Work in Portugal:</strong> Enjoy the flexibility of working remotely anywhere in Portugal while contributing to our global customer support team.</li><li style=\"\"><strong>Relocation Package:</strong> For those coming from abroad, experience the charms of Lisbon with our comprehensive relocation package, covering your journey to Portugal and ensuring a smooth transition.</li><li style=\"\"><strong>Competitive Compensation:</strong> Your dedication to delivering exceptional customer service is recognized and rewarded with a competitive salary reflecting your valuable contributions.</li><li style=\"\"><strong>Health and Life Insurance:</strong> Comprehensive coverage for your well-being and peace of mind, reflecting our commitment to your health.</li></ul> <p></p> <p>Excited to join our dynamic team in Portugal? Submit your CV today!</p><img src=\"https://remotive.com/job/track/1928744/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1928746,
    "url": "https://remotive.com/remote-jobs/customer-support/manager-customer-success-manager-1928746",
    "title": "Manager, Customer Success Manager",
    "company_name": "Deel",
    "company_logo": "https://remotive.com/job/1928746/logo",
    "category": "Customer Service",
    "tags": [
    "saas",
    "payroll",
    "HRIS",
    "fintech",
    "team lead",
    "diversity"
    ],
    "job_type": "full_time",
    "publication_date": "2024-08-06T14:50:03",
    "candidate_required_location": "Asia, APAC",
    "salary": "",
    "description": "<p style=\"min-height:1.5em\"><strong>Who we are is what we do.</strong></p><p style=\"min-height:1.5em\">Deel and our family of growing companies are made up of global teams dedicated to helping businesses hire anyone, anywhere, easily. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">The team comprises over three thousand self-driven individuals spanning over 100 countries, and our unified yet diverse culture keeps us continually learning and innovating the platform and products for customers.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Companies should be able to hire the best talent anywhere in the world, so we are building the best platform to make that a reality. Our market-leading technology, expertise, and global team are crucial to the platform’s success. We deliver the best products and features in our space, enabling millions of jobs worldwide and connecting the global workforce with the best companies and opportunities.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why should you be part of our success story?</strong></p><p style=\"min-height:1.5em\">A 30-mile hiring radius should no longer dictate how companies hire because exceptional talent lives everywhere. Deel sees a world without hiring borders and endless talent that pairs perfect candidates with great companies.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">We offer global teams all the tools they need to hire, onboard, manage, pay, and scale at full speed. We aim to foster a diverse global economy by building a generational platform that seamlessly connects companies with talent worldwide.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">After our successful Series D in 2021, we raised another $50M in 2023, doubling our valuation to $12B. There’s never been a more exciting time to join Deel — the international payroll and compliance market leader.</p><p style=\"min-height:1.5em\"><strong>What you will enjoy working on:</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Managing a growing team of Customer Success Managers in your region; recruiting, hiring, and training new team members.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Serving as a coach and a leader, helping to develop the skills of your CSMs as they help customers achieve their desired outcomes.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Build and Scale, Own, Optimize &amp; Impact the revenue stream by driving change and maximize the effectiveness of the Customer Success team to deliver greater value and grow our customers.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Organize and analyze customer and product data to identify and implement improvements to increase revenue growth, including partnering with Operations in designing and implementing processes, workflows, and automations.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Proactively surface opportunities to improve the team’s operational efficiency and the customer experience.</p></li></ul><p style=\"min-height:1.5em\"><strong>You will be successful if:</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">You have proven experience leading a CSM team within a rapidly-growing B2B SaaS company in a Team Lead or Manager role.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You are driven, think on your feet, and thrive in a fast-paced, challenging environment.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You have a track record of managing your team to meet or exceed customer renewal and retention goals in a high growth setting.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You are data-oriented.</p></li></ul><p style=\"min-height:1.5em\"><strong>Bonus Points</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">You have experience working with clients and team members from multiple countries and across multiple time zones.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You have Fintech, HRIS or Payroll experience.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You are proficient in Mandarin Chinese. </p></li><li style=\"\"><p style=\"min-height:1.5em\">You have experience working on a remote team.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You are based in in North Asia timezone.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You have experience working at a high growth start-up or scale up.</p></li></ul><p style=\"min-height:1.5em\"><strong>Total Rewards</strong></p><p style=\"min-height:1.5em\">Our workforce deserves fair and competitive pay that meets them where they are. With scalable benefits, rewards, and perks, our total rewards programs reflect our commitment to inclusivity and access for all. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Some things you’ll enjoy</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Provided computer equipment tailored to your role</p></li><li style=\"\"><p style=\"min-height:1.5em\">Stock grant opportunities dependent on your role, employment status and location</p></li><li style=\"\"><p style=\"min-height:1.5em\">Additional perks and benefits based on your employment status and country</p></li><li style=\"\"><p style=\"min-height:1.5em\">The flexibility of remote work, including WeWork access where available</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">At Deel, we’re an equal-opportunity employer that values diversity and positively encourage applications from suitably qualified and eligible candidates regardless of  race, religion, sex, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, pregnancy or maternity or other applicable legally protected characteristics.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>Unless otherwise agreed, we will communicate with job applicants using Deel-specific emails, which include @</em><a href=\"http://deel.com\" rel=\"nofollow\" target=\"_blank\"><em>deel.com</em></a><em> and other acquired company emails like @</em><a href=\"http://payspace.com\" rel=\"nofollow\" target=\"_blank\"><em>payspace.com</em></a><em> and @</em><a href=\"http://paygroup.com\" rel=\"nofollow\" target=\"_blank\"><em>paygroup.com</em></a><em>. You can view the most up-to-date job listings at Deel by visiting </em><a href=\"https://www.deel.com/careers\" rel=\"nofollow\" target=\"_blank\"><em><u>our careers page</u></em></a><em>.</em><br><br><em>Deel is an equal-opportunity employer and is committed to cultivating a diverse and inclusive workplace that reflects different abilities, backgrounds, beliefs, experiences, identities and perspectives.<br><br>Deel will provide accommodation on request throughout the recruitment, selection and assessment process for applicants with disabilities. If you require accommodation, please inform our Talent Acquisition Team at recruiting@deel.com of the nature of the accommodation that you may require, to ensure your equal participation.</em></p><p style=\"min-height:1.5em\"></p><img src=\"https://remotive.com/job/track/1928746/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1928748,
    "url": "https://remotive.com/remote-jobs/customer-support/customer-service-representative-1928748",
    "title": "Customer Service Representative",
    "company_name": "Enterprise Call Center",
    "company_logo": "https://remotive.com/job/1928748/logo",
    "category": "Customer Service",
    "tags": [
    "cloud",
    "CRM",
    "brand design",
    "technical support",
    "troubleshooting",
    "data entry"
    ],
    "job_type": "part_time",
    "publication_date": "2024-08-06T04:50:48",
    "candidate_required_location": "USA",
    "salary": "",
    "description": "<br><br><div class=\"h3\">Company Description</div><p>We recruit, train, and manage customer service representatives to represent global brands in customer care, technical support, and sales. Our reps provide professional customer care services through various integrated platforms that adapt to any client workspace.  Our cloud-based technology ensures consistent representation of branding efforts around the world.</p><br><br><div class=\"h3\">Job Description</div><p>We are looking for a customer-oriented service representative. A customer service representative, or CSR, will act as a liaison, provide product/services information and resolve any emerging problems that our customer accounts might face with accuracy and efficiency. The best CSRs are genuinely excited to help customers. They’re patient, empathetic, and passionately communicative. They love to talk. Customer service representatives can put themselves in their customers’ shoes and advocate for them when necessary. Customer feedback is priceless, and these CSRs can gather that for you. Problem-solving also comes naturally to customer care specialists. They are confident at troubleshooting and investigate if they don’t have enough information to resolve customer complaints. The target is to ensure excellent service standards, respond efficiently to customer inquiries and maintain high customer satisfaction.</p><p>Responsibilities</p><ul style=\"\"><li style=\"\">Manage large amounts of incoming calls Generate sales leads Identify and assess customers’ needs to achieve satisfaction Build sustainable relationships and trust with customer accounts through open and interactive communication Provide accurate, valid and complete information by using the right methods/tools Meet personal/customer service team sales targets and call handling quotas Handle customer complaints, provide appropriate solutions and alternatives within the time limits; follow up to ensure resolution Keep records of customer interactions, process customer accounts and file documents Follow communication procedures, guidelines and policies Take the extra mile to engage customers</li><li style=\"\">Generate sales leads Identify and assess customers’ needs to achieve satisfaction Build sustainable relationships and trust with customer accounts through open and interactive communication Provide accurate, valid and complete information by using the right methods/tools Meet personal/customer service team sales targets and call handling quotas Handle customer complaints, provide appropriate solutions and alternatives within the time limits; follow up to ensure resolution Keep records of customer interactions, process customer accounts and file documents Follow communication procedures, guidelines and policies Take the extra mile to engage customers</li><li style=\"\">Identify and assess customers’ needs to achieve satisfaction Build sustainable relationships and trust with customer accounts through open and interactive communication Provide accurate, valid and complete information by using the right methods/tools Meet personal/customer service team sales targets and call handling quotas Handle customer complaints, provide appropriate solutions and alternatives within the time limits; follow up to ensure resolution Keep records of customer interactions, process customer accounts and file documents Follow communication procedures, guidelines and policies Take the extra mile to engage customers</li><li style=\"\">Keep records of customer interactions, process customer accounts and file documents Follow communication procedures, guidelines and policies Take the extra mile to engage customers</li></ul><br><br><div class=\"h3\">Qualifications</div><ul style=\"\"><li style=\"\">Excellent customer service abilities</li><li style=\"\">Track record of over-achieving quota</li><li style=\"\">Good phone etiquette and communication skills</li><li style=\"\">Familiarity with CRM systems and practices</li><li style=\"\">Customer orientation and ability to adapt/respond to different types of characters</li><li style=\"\">Excellent communication and presentation skills</li><li style=\"\">Ability to multi-task, prioritize, and manage time effectively</li><li style=\"\">Proficient in English</li><li style=\"\">Strong data entry skills</li><li style=\"\">Computer skills</li><li style=\"\">Experience with outbound calling</li><li style=\"\">Analytical skills</li><li style=\"\">Multilingual or bilingual proficiency is a plus</li><li style=\"\">Sales and upselling experience preferred</li><li style=\"\">Spanish language proficiency advantageous</li><li style=\"\">At least 18 years old</li><li style=\"\">High school diploma or GED</li><li style=\"\">Authorized to work in the United States</li><li style=\"\">US resident (any state except CA, CO, CT, MA, MD, NY, OR, WA, or WI)</li></ul><br><br><div class=\"h3\">Additional Information</div><ul style=\"\"><li style=\"\">Paid Training</li><li style=\"\">Paid Time Off</li><li style=\"\">Flexible Schedule</li><li style=\"\">Free Telehealh Plan</li><li style=\"\">Wellness Resources</li><li style=\"\">Training &amp; Development</li><li style=\"\">Advancement Opportunities</li><li style=\"\">All your information will be kept confidential according to EEO guidelines.</li></ul><img src=\"https://remotive.com/job/track/1928748/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1928783,
    "url": "https://remotive.com/remote-jobs/customer-support/dutch-speaking-travel-agent-1928783",
    "title": "Dutch Speaking Travel Agent",
    "company_name": "Cross Border Talents",
    "company_logo": "https://remotive.com/job/1928783/logo",
    "category": "Customer Service",
    "tags": [
    "travel",
    "insurance"
    ],
    "job_type": "full_time",
    "publication_date": "2024-08-06T00:50:41",
    "candidate_required_location": "Bulgaria",
    "salary": "competitive salary and benefits",
    "description": "<p>Are you a language enthusiast proficient in Dutch, ready to embark on a journey in the exciting world of travel? Seize the opportunity to join us as a Dutch-Speaking Travel Agent in Bulgaria! Whether you're a seasoned professional or a rising talent, we welcome you to be an integral part of our team. Enjoy an enticing relocation package, including accommodation in Sofia and flight tickets, along with perks like competitive salary, health and life insurance, and abundant opportunities for career growth. This role is tailored for those passionate about travel and dedicated to providing exceptional service to our clients.</p> <p><strong>About Us:</strong></p> <p>At our company, we're committed to delivering outstanding travel experiences to our clients. As a leading player in the travel industry, we take pride in our dedication to customer satisfaction and innovation. Our dynamic team in Bulgaria thrives on creativity, collaboration, and a shared passion for travel. Join us as a Dutch-Speaking Travel Agent and become part of a vibrant community that actively shapes the future of travel.</p> <p><strong>Position Overview:</strong></p> <p>As a Dutch-Speaking Travel Agent, you'll be more than just a representative – you'll be the face of our company. Your role extends beyond booking travel arrangements; you'll be instrumental in creating memorable experiences for our Dutch-speaking clients. This remote position in Bulgaria offers a unique opportunity to immerse yourself in the world of travel while enjoying the flexibility of remote work.</p> <p><strong>Key Responsibilities:</strong></p> <ul style=\"\"><li style=\"\">Assist Dutch-speaking clients with booking flights, accommodations, and other travel services.</li><li style=\"\">Provide personalized recommendations based on clients' preferences, interests, and budget.</li><li style=\"\">Handle inquiries and resolve issues promptly to ensure a seamless travel experience.</li><li style=\"\">Stay updated on travel trends, destination information, and industry developments to offer relevant assistance and advice.</li><li style=\"\">Collaborate with team members to streamline processes and enhance customer satisfaction.</li></ul> <p><strong>Qualifications:</strong></p> <ul style=\"\"><li style=\"\">Fluent in Dutch (both written and spoken).</li><li style=\"\">Excellent communication and interpersonal skills.</li><li style=\"\">Strong attention to detail and problem-solving abilities.</li><li style=\"\">Previous experience in the travel industry is preferred but not required.</li><li style=\"\">Ability to work independently and efficiently in a remote setting.</li></ul> <p><strong>Perks:</strong></p> <ul style=\"\"><li style=\"\">Remote work from Bulgaria, allowing for flexibility and work-life balance.</li><li style=\"\">Relocation package, including accommodation in Sofia and flight tickets, for candidates relocating from abroad.</li><li style=\"\">Competitive salary and benefits package, including health and life insurance.</li><li style=\"\">Opportunities for career growth and advancement within the company.</li></ul> <p>Join us in shaping the future of travel and creating unforgettable experiences for our clients. Apply now to become a valued member of our team and embark on an exciting journey in the travel industry!</p><img src=\"https://remotive.com/job/track/1928783/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1928784,
    "url": "https://remotive.com/remote-jobs/customer-support/travel-consultant-1928784",
    "title": "Travel Consultant",
    "company_name": "HHH Affiliates",
    "company_logo": "https://remotive.com/job/1928784/logo",
    "category": "Customer Service",
    "tags": [
    "time management"
    ],
    "job_type": "part_time",
    "publication_date": "2024-08-05T20:50:56",
    "candidate_required_location": "USA",
    "salary": "",
    "description": "<p>We are a leading travel agency dedicated to providing our clients with exceptional travel experiences. Our team of passionate travel experts works remotely to curate personalized itineraries, secure the best deals, and ensure seamless travel arrangements. We are looking for a dynamic and detail-oriented Remote Travel Agent to join our team.<br></p> <p><strong>Job Summary:</strong></p> <p>The Remote Travel Consultant will be responsible for assisting clients with planning and booking travel arrangements, including flights, accommodations, car rentals, and tours. This role requires excellent customer service skills, a keen eye for detail, and the ability to work independently in a remote environment.</p> <p><strong>Key Responsibilities:</strong></p> <p>- **Client Consultation:** Conduct thorough consultations with clients to understand their travel preferences, needs, and budget.</p> <p>- **Travel Planning:** Research and recommend travel destinations, accommodations, transportation options, and activities that match clients' preferences and budget.</p> <p>- **Booking and Reservations:** Make reservations for flights, hotels, rental cars, tours, and other travel-related services.</p> <p>- **Itinerary Management:** Create detailed travel itineraries and provide clients with all necessary travel documents and information.</p> <p>- **Customer Service:** Address clients' inquiries, provide support during travel, and resolve any issues or emergencies that may arise.</p> <p>- **Vendor Relations:** Build and maintain relationships with travel vendors and suppliers to secure the best rates and offers for clients.</p> <p>- **Administrative Tasks:** Handle administrative duties such as processing payments, managing bookings, and maintaining accurate client records.<br></p> <p>- **Market Research:** Stay updated on travel trends, destination information, and industry news to provide clients with the best advice and recommendations.</p> <p><strong>Qualifications:</strong></p> <p>- **Skills:** Strong customer service and communication skills, excellent organizational and time-management abilities<br></p> <p>- **Technology:** Comfortable with remote work technology and tools such as CRM software, video conferencing, and online booking platforms.<br></p> <p>- **Independent:** The ability to work independently and with little supervision<br></p> <p><strong>Benefits:</strong></p> <p>- Flexible work hours</p> <p>- Opportunity to work remotely from anywhere</p> <p>- Professional development and training opportunities</p> <p>- Travel discounts and perks</p> <p>- Supportive and collaborative team environment</p> <p>Apply today! Join our team and help clients create unforgettable travel experiences from the comfort of your own home!</p><img src=\"https://remotive.com/job/track/1928784/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1927944,
    "url": "https://remotive.com/remote-jobs/customer-support/customer-service-rep-1927944",
    "title": "Customer Service Rep",
    "company_name": "Omni Interactions",
    "company_logo": "https://remotive.com/job/1927944/logo",
    "category": "Customer Service",
    "tags": [
    "android",
    "security",
    "chat",
    "insurance"
    ],
    "job_type": "contract",
    "publication_date": "2024-08-01T18:37:29",
    "candidate_required_location": "USA",
    "salary": "$14- $20/hr",
    "description": "<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">Omni supports many clients. Independent contractors who are among the qualified candidates will provide customer service (taking inbound phone calls, answering chat messages, &amp; responding to emails) for Fortune 500 companies.</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">You will interact with customers primarily through inbound phone calls and possibly chat/email, helping them with all their needs.</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\"> </span></p>\n<p style=\"color: #333333;\"><strong><span style=\"color: #2a2a2a;\">Schedule:</span></strong></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">🤙</span><span style=\"color: #2a2a2a;\"> Flexible work schedule options available</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">⏰</span><span style=\"color: #2a2a2a;\"> Majority of work hours are during weekdays and daytime</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">🗓️</span><span style=\"color: #2a2a2a;\"> Opportunity to create a work schedule that works best for you</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\"> </span></p>\n<p style=\"color: #333333;\"><strong><span style=\"color: #2a2a2a;\">Earnings &amp; Revenue:</span></strong></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">💵</span><span style=\"color: #2a2a2a;\"> Contract earnings vary by client, with competitive rates typically ranging from $14 to $20 per hour</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">📞</span><span style=\"color: #2a2a2a;\"> Pay is determined by your phone call status when assisting customers</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">🤑</span><span style=\"color: #2a2a2a;\"> Additional incentives available based on client and performance metrics.</span><span style=\"color: #2a2a2a;\"> </span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\"> </span></p>\n<p style=\"color: #333333;\"><strong><span style=\"color: #2a2a2a;\">Required Skills for Successful Contractors:</span></strong></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">💬</span><span style=\"color: #2a2a2a;\"> Exceptional written and verbal communication skills</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">✅</span><span style=\"color: #2a2a2a;\"> Proven track record in customer service and delivering outstanding customer care</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">🧐</span><span style=\"color: #2a2a2a;\"> Keen attention to detail with strong problem-solving skills</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">🤗</span><span style=\"color: #2a2a2a;\"> Friendly, empathetic tone, and professional demeanor</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">🙌</span><span style=\"color: #2a2a2a;\"> Self-motivated, proactive, and resourceful mindset</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">👩‍💻</span><span style=\"color: #2a2a2a;\"> Proficient in using technology, including computer applications and software.</span></p>\n<p style=\"color: #333333;\"><strong><span style=\"color: #2a2a2a;\"> </span></strong></p>\n<div class=\"h2\" style=\"font-weight: 600; line-height: 1.1; color: #333333; margin-top: 18px; margin-bottom: 9px;\">Important Information  </div>\n<p style=\"color: #333333;\"><strong><span style=\"color: #2a2a2a;\">Technology &amp; Equipment Requirements:</span></strong></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">🚪</span><span style=\"color: #2a2a2a;\"> Quiet and secure work environment during working hours</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">💻</span><span style=\"color: #2a2a2a;\"> Personal computer with a minimum of 8GB RAM (tablets and Chromebooks are not permitted)</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">🎧</span><span style=\"color: #2a2a2a;\"> Wired USB headset with microphone for clear communication</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">💨</span><span style=\"color: #2a2a2a;\"> High-speed wired internet with a minimum of 10 Mbps download speed for seamless connectivity. <strong>Please note: You cannot use Mobile home internet (T-Mobile/Verizon, etc) or Satellite internet service. </strong></span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">🪟</span><span style=\"color: #2a2a2a;\">Operating system of Windows 10 or Windows 11 (some clients may accept AppleOS)</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">👾</span><span style=\"color: #2a2a2a;\"> Valid and up-to-date antivirus software installed</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">🤳</span><span style=\"color: #2a2a2a;\">Smart phone, Android tablet or iPad is required for program work, along with an authentication app.</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">💻</span><span style=\"color: #2a2a2a;\"> Windows 10 or Windows 11 operating system must be used (some clients will accept an AppleOS)</span></p>\n<p style=\"color: #333333;\"> </p>\n<p style=\"color: #333333;\"><strong><span style=\"color: #2a2a2a;\">Work Environment Requirements:</span></strong></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">🤫</span><span style=\"color: #2a2a2a;\"> Quiet, uninterrupted space</span></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\">⌨️</span><span style=\"color: #2a2a2a;\"> Organized desk area</span></p>\n<p style=\"color: #333333;\"> </p>\n<p style=\"color: #333333;\"> </p>\n<p style=\"color: #333333;\"><em><span style=\"color: #2a2a2a;\">We are currently unable to work with contractors residing in Alaska, California, Connecticut, Delaware, Illinois, Michigan, Maine, Massachusetts, Maryland, New Jersey, New York, Oregon, Rhode Island, Vermont, Washington, or Washington DC. Contractors must also successfully pass a criminal background check.</span></em></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\"> </span></p>\n<p style=\"color: #333333;\"><em><span style=\"color: #2a2a2a;\">We <strong>are</strong> able to work with contractors residing in Alabama, Arizona, Arkansas, Colorado, Florida, Georgia, Hawaii, Idaho, Indiana, Iowa, Kansas, Kentucky, Louisiana, Minnesota, Mississippi, Missouri, Montana, Nebraska, Nevada, New Hampshire, New Mexico, North Carolina, North Dakota, Ohio, Oklahoma, Pennsylvania, South Carolina, South Dakota, Texas, Tennessee, Utah, Virginia, West Virginia, Wisconsin, Wyoming and Puerto Rico.</span></em></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\"> </span></p>\n<p style=\"color: #333333;\"><em><span style=\"color: #2a2a2a;\">Contractual Relationship: The relationship between you and Omni Interactions is a contractual relationship. You will remain an independent contractor for the duration of your program assignment. Omni Interactions will not be responsible for withholding taxes on your earnings while contracted with Omni Interactions. When you receive your contract, you will be asked to agree to have no claim against Omni Interactions hereunder or otherwise for vacation pay, sick leave, retirement benefits, Social Security, worker’s compensation, health or disability benefits, overtime, unemployment insurance benefits or employee benefits of any kind.</span></em></p>\n<p style=\"color: #333333;\"><span style=\"color: #2a2a2a;\"> </span></p>\n<img src=\"https://remotive.com/job/track/1927944/blank.gif?source=public_api\" alt=\"\"/>",
    "company_logo_url": "https://remotive.com/job/1927944/logo"
    }
    ]
    }