{
    "00-warning": "Remotive main domain moved to remotive.com ! Please make your API calls on remotive.com/api/remote-jobs instead of remotive.io now ;) Legacy endpoint remotive.io/api/remote-jobs will be terminated in June 2022. Thank you!",
    "0-legal-notice": "Legal warning - Hey, thanks for using Remotive's API, we appreciate it! Please note that API documentation and access is granted so that developers can share our jobs further. Please do not submit Remotive jobs to third Party websites, including but not limited to: Jooble, Neuvoo, Google Jobs, LinkedIn Jobs. Please link back to the URL found on Remotive AND mention Remotive as a source in order to Remotive to get traffic from your listing. If you don't do that, we'll terminate your API access, sorry! Jobs displayed are delayed by 24 hours, the goal being that jobs are attributed to Remotive on various platforms. Displaying our jobs in order to collect signups/email addresses to show a listing constitutes a breach of our terms of services. We offer a private, paid-for API, please email us at hello(at)remotive(dot)io for more information (starting budget is $5k/mo). Please find out terms of services on https://remotive.com/api-documentation. Please note that there is absolutely no need to request Remotive Job data too frequently. Typically, you only need to GET Remotive job data through this API a couple of times a day (we advise max. 4 times a day). Our data is not changing much faster than that anyway. Note that excessive requests will be blocked. Many thanks (Rodolphe & the Remotive team!)",
    "job-count": 10,
    "jobs": [
    {
    "id": 1927912,
    "url": "https://remotive.com/remote-jobs/design/manager-product-design-1927912",
    "title": "Manager, Product Design",
    "company_name": "Chainalysis Careers",
    "company_logo": "https://remotive.com/job/1927912/logo",
    "category": "Design",
    "tags": [
    "Figma",
    "visual design",
    "ux research"
    ],
    "job_type": "full_time",
    "publication_date": "2024-08-07T10:50:57",
    "candidate_required_location": "EMEA, UK",
    "salary": "",
    "description": "<p style=\"min-height:1.5em\">The global financial ecosystem is changing. Revolutionary blockchain technology has unlocked the potential for people worldwide to have equal access to wealth and information. This transformation has begun with the mass global adoption of cryptocurrencies. Still, like all new financial systems, it needs greater trust to realize its full potential and remain safe from bad actors. That’s where we come in. The Chainalysis blockchain data platform enables businesses, governments, and banks to solve the world’s most high-profile criminal cases, paving the way for an economy built on blockchains.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Chainalysis is the key voice in building trust in blockchains today, collaborating with the world’s leading government agencies, cryptocurrency exchanges, financial institutions, and cybersecurity companies in over 60 countries.  Our data platform powers investigation, compliance, and risk management tools that have been used to solve some of the world’s most high-profile cyber crime cases and ensure global access to cryptocurrency safely.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">In this role, you will lead a talented team of product designers who strive to build impactful, valuable, and easy-to-use products. You will oversee the user experience of the Chainalysis compliance products from conception to launch,  partnering closely with product managers, engineers, and UX researchers. Our team values curiosity, cross-functional team collaboration, and a devotion to craft. As a Product Design Manager, we expect you to skillfully utilize your product, interaction, and visual toolkit to build innovative, user-friendly experiences for a diverse, global audience.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>In one year you’ll know you were successful if…</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">You feel fully confident collaborating with your Product and Engineering partners to influence the product roadmap, identify opportunities, and make decisions based on impact to Chainalysis users.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You consistently empower and manage the designers on your team, pushing them to produce their best work</p></li><li style=\"\"><p style=\"min-height:1.5em\">You document and build on design systems as they pertain to your product and provide guidance on cross-product design strategy - moving us towards a more cohesive and coherent product experience</p></li><li style=\"\"><p style=\"min-height:1.5em\">You both welcome and actively solicit feedback from cross-functional teams to build better work processes and cultivate your partnerships.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You are a proactive champion for design thinking across the organization and actively work to push the boundaries of innovation and efficiency in your design process</p></li><li style=\"\"><p style=\"min-height:1.5em\">You are devoted to excellence and continually raise the bar for quality across every design touchpoint in the organization</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>A background like this helps: </strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">At least 6 years in product design with 2+ years of directly managing product designers</p></li><li style=\"\"><p style=\"min-height:1.5em\">Proven track record of working within a product team to ship successful experiences to users</p></li><li style=\"\"><p style=\"min-height:1.5em\">Comfortable representing work to a broader product team and other stakeholders, clearly and succinctly articulating the goals and concepts</p></li><li style=\"\"><p style=\"min-height:1.5em\">Excellence and efficiency in using Figma, Confluence,</p></li><li style=\"\"><p style=\"min-height:1.5em\">Outstanding visual design taste combined with holistic UX understanding</p></li><li style=\"\"><p style=\"min-height:1.5em\">Strong portfolio of past work that showcases using best-in-class interaction and visual design as tools to drive product growth</p></li><li style=\"\"><p style=\"min-height:1.5em\">Passion for asking the right questions and ability to leverage all available resources–such as conducting user research or delving into analytics–to formulate solutions to complex problems</p></li><li style=\"\"><p style=\"min-height:1.5em\">Entrepreneurial mindset and exceptionally proactive about guiding strategic thinking in a greenfield, innovative product space </p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Bonus points if you:</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Have experience with B2B, fintech, or especially, cryptocurrency products</p></li><li style=\"\"><p style=\"min-height:1.5em\">You have previously worked on technical products and data visualizations</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About Chainalysis</strong></p><p style=\"min-height:1.5em\">Blockchain technology is powering a growing wave of innovation. Businesses and governments around the world are using blockchains to make banking more efficient, connect with their customers, and investigate criminal cases. As adoption of blockchain technology grows, more and more organizations seek access to all this ecosystem has to offer. That’s where Chainalysis comes in. We provide complete knowledge of what’s happening on blockchains through our data, services, and solutions. With Chainalysis, organizations can navigate blockchains safely and with confidence.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>You belong here. </strong></p><p style=\"min-height:1.5em\">At Chainalysis, we believe that diversity of experience and thought makes us stronger. With both customers and employees around the world, we are committed to ensuring our team reflects the unique communities around us. Some of the ways we’re ensuring we keep learning are an internal Diversity Committee, Days of Reflection throughout the year including International Women’s Day, Harvey Milk Day, World Humanitarian Day, and UN International Migrants Day, and a commitment to continue revisiting and reevaluating our diversity culture. </p><p style=\"min-height:1.5em\">We encourage applicants across any race, ethnicity, gender/gender expression, age, spirituality, ability, experience and more. If you need any accommodations to make our interview process more accessible to you due to a disability, don't hesitate to let us know. You can learn more <a href=\"https://go.chainalysis.com/rs/503-FAP-074/images/Interview Accommodations Request.pdf\" rel=\"nofollow\" target=\"_blank\">here</a>. We can’t wait to meet you. </p><img src=\"https://remotive.com/job/track/1927912/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1927913,
    "url": "https://remotive.com/remote-jobs/design/staff-ux-product-designer-1927913",
    "title": "Staff UX Product Designer",
    "company_name": "Cribl",
    "company_logo": "https://remotive.com/job/1927913/logo",
    "category": "Design",
    "tags": [
    "CSS",
    "html",
    "Figma",
    "prototyping"
    ],
    "job_type": "full_time",
    "publication_date": "2024-08-07T06:50:13",
    "candidate_required_location": "USA",
    "salary": "$150,000 - $215,000",
    "description": "<div class='\"content-intro\"'><p>Cribl does differently. </p>\n<p>What does that mean? It means we are a serious company that doesn’t take itself too seriously; and we’re looking for people who love to get stuff done, and laugh a bit along the way. We’re growing rapidly - looking for collaborative, curious, and motivated team members who are passionate about putting customers first. As a remote-first company we believe in empowering our employees to do their best work, wherever they are. </p>\n<p>As the data engine for IT and Security many of the biggest names in the most demanding industries trust Cribl to solve their most pressing data needs. Ready to do the best work of your career? Join the herd and unlock your opportunity.</p></div><p><span style='\"font-size:'><strong>Why You'll Love This Role</strong></span></p>\n<p>Cribl is dedicated to empowering businesses with solutions that make it easy to manage and enrich their data. We are committed to creating innovative products that provide unparalleled value and support to our customers. Our mission is to simplify the complexity of data management and to enable our users to gain actionable insights efficiently.</p>\n<p>We are seeking an experienced and visionary Staff UX Product Designer to join our growing design team at Cribl. This pivotal role will focus on shaping and executing our design strategy, bringing cohesion to our product suite, and driving major initiatives for end-to-end user experience (E2E UX) across our products. The ideal candidate will have a strong background in UX design, a passion for user-centered design, and the ability to collaborate effectively with cross-functional teams.</p>\n<p> </p>\n<p><span style='\"font-size:'><strong>As An Active Member Of This Team, You Will</strong></span></p>\n<ul style=\"\">\n<li style=\"\">Design Strategy: Develop and implement a comprehensive UX design strategy that aligns with Cribl's business goals and product vision. Ensure a cohesive and seamless user experience across all Cribl products.</li>\n<li style=\"\">Product Cohesion: Work closely with the design team, product managers, engineers, and other stakeholders to ensure a unified design language and consistent user experience across the product suite. Create and maintain design systems and guidelines.</li>\n<li style=\"\">E2E UX Initiatives: Lead and drive major UX initiatives that span multiple products, ensuring an integrated and intuitive user experience from start to finish.</li>\n<li style=\"\">User Research: Conduct user research and usability testing to gather insights and feedback. Translate findings into actionable design improvements and strategic recommendations.</li>\n<li style=\"\">Collaboration: Partner with the design team and cross-functional teams to define and prioritize design projects. Facilitate workshops, design sprints, and brainstorming sessions to foster innovation and collaboration.</li>\n<li style=\"\">Mentorship: Provide guidance and mentorship to junior designers, fostering a culture of growth and continuous improvement within the design team.</li>\n<li style=\"\">Prototyping: Create design concepts, high-fidelity prototypes and detailed design specifications to effectively communicate design concepts and interactions.</li>\n<li style=\"\">Feedback: Gather and incorporate feedback from users, stakeholders, and team members to iteratively improve and refine designs.</li>\n<li style=\"\">Advocacy: Advocate for user-centered design principles and practices throughout the organization, promoting a deep understanding of our users and their needs.</li>\n<li style=\"\">User Centric Design: Gain a deep understanding of our tools and the way our customers use them to help drive product innovation and guide user experiences across all Cribl products.</li>\n<li style=\"\">Drive Design Maturity: Lead by example and help grow Cribl’s design maturity through your expert understanding of our products and UX best practices like design led workshops, journey mapping exercises and vision projects.</li>\n</ul>\n<p> </p>\n<p><span style='\"font-size:'><strong>If You've got it - We Want it</strong></span></p>\n<ul style=\"\">\n<li style=\"\">Experience: Minimum of 8 years of experience in UX design, with a proven track record of leading design strategy and driving cross-functional initiatives. Experience in enterprise software or data management products is a plus.</li>\n<li style=\"\">Skills: Proficiency in design tools such as Figma and prototyping tools like InVision or Axure. Working knowledge of HTML, CSS, and JavaScript is a plus.</li>\n<li style=\"\">Communication: Excellent verbal and written communication skills, with the ability to articulate design concepts and decisions to stakeholders at all levels.</li>\n<li style=\"\">Collaboration: Demonstrated ability to work effectively in a collaborative, team-oriented environment. Experience leading workshops and design sprints is preferred.</li>\n<li style=\"\">Education: Bachelor's or Master's degree in UX Design, Interaction Design, Human-Computer Interaction, or a related field.</li>\n</ul>\n<p> </p>\n<p><strong>Salary Range ($150,000 - $215,000)</strong></p>\n<p>The salary for this role is dependent on geographic location. The salary offered within the range described will be based on the individual candidate’s job-related knowledge, skills, and experience.  In addition to a competitive salary, Cribl also offers a generous benefits package which includes health, dental, vision, short-term disability, and life insurance, paid holidays and paid time off, a fertility treatment benefit, 401(k), equity, and eligibility for a discretionary</p>\n<p><span style='\"color:'>#LI-JB1</span></p><div class='\"content-conclusion\"'><p><strong>Bring Your Whole Self</strong><span style='\"font-weight:'><br></span><span style='\"font-weight:'>Diversity drives innovation, enables better decisions to support our customers, and inspires change for the better. We’re building a culture where differences are valued and welcomed, and we work together to bring out the best in each other. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.</span></p>\n<p><span style='\"font-weight:'>Interested in joining the Cribl herd? Learn more about the smartest, funniest, most passionate goats you’ll ever meet at </span><a href=\"%22https://cribl.io/about-us/%22\" rel=\"nofollow\"><span style='\"font-weight:'>cribl.io/about-us</span></a><span style='\"font-weight:'>. </span></p></div><img src=\"https://remotive.com/job/track/1927913/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1927915,
    "url": "https://remotive.com/remote-jobs/design/senior-product-designer-1927915",
    "title": "Senior Product Designer",
    "company_name": "Paltaltd",
    "company_logo": "https://remotive.com/job/1927915/logo",
    "category": "Design",
    "tags": [
    "CRO"
    ],
    "job_type": "full_time",
    "publication_date": "2024-08-06T22:50:13",
    "candidate_required_location": "UK, Cyprus",
    "salary": "competitive salary package commensurate with experience",
    "description": "<div class='\"content-intro\"'><p>Palta is a multi-product tech platform developing several mobile apps focused on health and well-being with a combined audience of more than 60 million monthly active users. Our portfolio includes such successful companies as Flo (global leader in female health), Simple (a nutrition and wellness app with over 15m downloads), Zing (personal fitness trainer), and more. <br>The rapid portfolio growth was fueled by the recently raised $100 million Series B round led by VNV Global, and the group’s revenue is currently sustainably growing 50% YoY.</p></div><p>Simple Fasting, part of the Palta family, is a game-changing AI-powered health &amp; wellness platform aimed to provide intermittent fasting followers with a solution that would support them in achieving tangible fitness results.</p>\n<p>Our mission is to give day-to-day personal insight into people's nutrition leading to healthier lives through behavior change.</p>\n<p>Simple is the most popular fasting app in the US. The  app securely aggregates, stores and analyzes user data to help users make long-term lifestyle changes that can improve their wellbeing.</p>\n<p>The company collaborates with doctors and health researchers to develop science-based solutions that are 100% safe.</p>\n<p>There's more info on our website:</p>\n<p><a href=\"%22https://simple.life/%22\" rel=\"nofollow\">https://simple.life/</a></p>\n<p>Simple is looking for a <strong>Senior Product Designer (Growth and Monetisation) </strong>to join our amazing Growth Design Team. Your expertise will contribute to our ambitious goal of positively impacting the nutrition and quality of life for over a 1,000,000,000 people worldwide. As a Senior Product Designer, you will focus on conversion rate optimisation (CRO) from a UI/UX perspective, turning users into loyal, paying customers through intuitive and effective design solutions.</p>\n<div class=\"h3\"><strong>Our key values are:</strong></div>\n<ul class='\"p-rich_text_list' style=\"\">\n<li style=\"\">As market leaders in monetisation and conversion rate optimisation (CRO), we set the standard for excellence. We seek a specialist who can continue to push the boundaries, finding efficient, non-obvious solutions that keep us ahead;</li>\n<li style=\"\">The ideal candidate delves deep, not just skimming the surface. We value professionals who think critically, analyze extensively, and understand the nuances of user behavior and market trends.;</li>\n<li style=\"\">It's crucial to stay abreast of the latest trends, but more importantly, to understand them. We're looking for someone who can interpret market shifts and user habits, applying this understanding to drive impactful monetisation strategies;</li>\n<li style=\"\">Deep knowledge of customer habits and psychology is key. Our aim is to create solutions that resonate with users, ensuring our strategies are grounded in real, actionable insights into what drives user decisions and loyalty.</li>\n</ul>\n<div class=\"h3\"><strong>Job requirements:</strong></div>\n<ul class='\"p-rich_text_list' style=\"\">\n<li style=\"\">Turning free users to paying customers through working with value positioning and optimizing growth funnels</li>\n<li style=\"\">Proven experience in web-based CRO, with a knack for increasing user engagement and boosting paid conversions;</li>\n<li style=\"\">Strong skills in modern mobile app product design, with a focus on monetization-friendly UX/UI;</li>\n<li style=\"\">Proficient in using UX research, and data analytics to guide design decisions;</li>\n<li style=\"\">A perfect candidate would have 5+ years of experience in world-class consumer products and a proven track record in enhancing monetization</li>\n</ul>\n<div class=\"h3\"><strong>Application Review Process: </strong></div>\n<ol style=\"\">\n<li style=\"\">CV and Portfolio Review</li>\n<li style=\"\">HR Screening</li>\n<li style=\"\">Design Team Interview</li>\n<li style=\"\">Test Assignment</li>\n<li style=\"\">Growth Team Interview</li>\n</ol>\n<div class=\"h3\"><strong>Perks and benefits</strong><strong>:</strong></div>\n<ul class='\"p-rich_text_list' style=\"\">\n<li style=\"\">Competitive salary package commensurate with experience;</li>\n<li style=\"\">Remote, in-office, and hybrid work opportunities;</li>\n<li style=\"\">Relocation package (Cyprus);</li>\n<li style=\"\">The equipment you need to do your job;</li>\n<li style=\"\">A premium SIMPLE subscription;</li>\n<li style=\"\">21 days annual leave, plus bank holidays (those observed where you live);</li>\n<li style=\"\">Support to learn English, should you need (or want) to;</li>\n<li style=\"\">Flexible hours. We focus on your results, not how long you spend at your desk.</li>\n</ul><div class='\"content-conclusion\"'><div class=\"h5\"><em>Please read our<a href=\"%22https://efficient-seal-8e4.notion.site/Palta-Candidate-Privacy-Notice-0e417b6638934369b9ea8855c7f6fa3b%22\" rel=\"nofollow\" target='\"_blank\"'> privacy notice </a>in respect of your application </em></div>\n<div class=\"h5\"><em>Please note that your personal data will be stored for one year, as reasonably necessary to resolve any disputes within the hiring process, if any occur.</em></div>\n<p> </p>\n<p> </p></div><img src=\"https://remotive.com/job/track/1927915/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1927916,
    "url": "https://remotive.com/remote-jobs/design/digital-designer-1927916",
    "title": "Digital Designer",
    "company_name": "dazn",
    "company_logo": "https://remotive.com/job/1927916/logo",
    "category": "Design",
    "tags": [
    "adobe photoshop",
    "adobe illustrator"
    ],
    "job_type": "full_time",
    "publication_date": "2024-08-06T18:50:51",
    "candidate_required_location": "UK",
    "salary": "",
    "description": "<div><span style=\"font-size: 16px\">The Senior Digital Designer is responsible for the creation of first-class marketing design across all online marketing channels. The Digital Designer will be an integral part of a team of the marketing team who are tasked with producing engaging &amp; effective on brand visual communications for customers. </span></div><div><span style=\"font-size: 16px\"> </span></div><div><span style=\"font-size: 16px\">The role requirements and responsibilities involve day to day development, brand governance and vigilance to ensure consistency across all market materials, the ability to take the lead on creative projects and initiatives and good stakeholder relationships to provide expert design advice to the business. </span></div><div><br></div><div><span style=\"font-size: 16px\">DAZN Bet is a sports betting and gaming brand which launched in 2022, brought to you in partnership with DAZN. Our vision is to provide sports betting to sports fans – adding to the excitement of watching your favourite game and bringing you closer to the action than ever before.</span></div><div><br></div><div><span style=\"font-size: 16px\">Watch it on DAZN. Call it at DAZN Bet. We’re football fans at DAZN Bet. We’re Formula 1 fans, tennis fans, boxing fans and basketball fans. Put simply, we’re sports fans, and our ambition is to combine our love of live sport with the thrill of having skin in the game.</span></div><div><br></div><div><span style=\"font-size: 16px\">DAZN Bet. Betting for sports fans.</span></div><br><br><div class=\"h3\">As our new Digital Designer, you’ll have the opportunity to:</div><li style=\"\">Responsible for the production of high-quality design work for all marketing activities to ensure the delivery of world class visual communications</li><li style=\"\">Responsible for the creation and delivery of strong and dynamic content from conception through to final production. This will involve researching, brainstorming and creating concepts in collaboration, working from an initial brief to final sign off.</li><li style=\"\">Ability to be highly communicative in face to face meetings and throughout ideation processes to ensure the brief is met.</li><li style=\"\">Work closely with the local market team and the various team members in  Gaming, Marketing, Product and Account Relationship Management and various third parties to develop concepts and ideas that deliver the high quality customer experiences on brand product websites and in marketing communications.</li><li style=\"\">Create and maintain effective content for the brand web page CMS (content management system) according to the relevant requirements brief.</li><li style=\"\">Quality check and proof all personal design and production output to ensure completed work is error-free, meets the brief, and achieves the desired design standards and brand guidelines. </li><li style=\"\">Ensure work produced is consistent with the creative direction and brand guidelines defined by the DAZN Bet MD &amp; DAZN. </li><li style=\"\">Maintain strong working relationships with team members in other locations and stakeholders in establishing good, effective communication levels required to provide effective design advice and guidance to clients. </li><li style=\"\">Consulting and advising on all projects across the business where design input is required, and liaising with third parties when necessary to ensure all materials are executed to high quality and on brand</li><li style=\"\">Work with Brand team to create and regularly update Brand Guidelines; ensure that all activity delivered is consistent with the Brand guidelines ensure stakeholders are up to date.</li><br><br><div class=\"h3\">You'll have:</div><li style=\"\">Significant experience working in a design studio or creative agency </li><li style=\"\">Education in web design, graphic design or equivalent work experience.</li><li style=\"\">Previous experience in the creation of digital products, platforms, Web &amp; Mobile experiences, Mobile applications.</li><li style=\"\">Master of Adobe Photoshop &amp; illustrator, able to produce production-ready assets for developers.</li><li style=\"\">Flash animation, video editing, motion graphics knowledge (after effects).</li><li style=\"\">Good understanding of User Experience, User Centered Design and Responsive Web Design on mobile platforms such as iOS and Android.</li><li style=\"\">Ability to create simple, effective, engaging web graphics.</li><li style=\"\">Knowledge of printing processes, preparing artwork for printing is beneficial.</li><li style=\"\">Skilled in 3D design tools such as 3DS Max, 4D Cinema is advantageous.</li><li style=\"\">Strong stakeholder management experience</li><li style=\"\">Strong understanding of Brand guidelines &amp; design principles for offline and online media</li><li style=\"\">Strong communications skills (written, verbal and presentational)</li><li style=\"\">Strong organizational and project management skills</li><li style=\"\">Ability to develop strong working relationships with internal and third party service providers </li><li style=\"\">Previous track record of creating innovative digital experiences that yield an impressive ROI</li><div><br></div><div>At DAZN, we bring ambition to life. We are innovators, game-changers and pioneers. So, if you want to push boundaries and make an impact, DAZN is the place to be. </div><div><br></div><div>As part of our team,you'll have the opportunity to make your mark and the power to make change happen. We're doing things no-one has done before, giving fans and customers access to sport anytime, anywhere. We're using world-class technology to transform sports and revolutionise the industry and we're not going to stop. </div><div> </div><div><b>DAZN VALUES – THE ‘HOW’ IN WHAT WE DO: </b> </div><div> </div><div><b>AMBITIOUS – people who want to make a big impact and drive DAZN forward.  </b></div><div> </div><div><b>INVENTIVE – people with bright ideas who deliver great new experiences for our customers – and improvements for our business.  People who come up with better, simpler ways of doing things.</b> </div><div> </div><div><b>PASSIONATE – people who are proud of our product, our content and our business – and love to shout about it.  People who love what they do and show commitment every day.</b> </div><div> </div><div><b>BRAVE – people who take difficult decisions to help us focus on improving DAZN, our performance and our results.  </b></div><div> </div><div><b>SUPPORTIVE – people who know that we achieve more as a team than as individuals.  People value inclusion and look out for each other, helping their colleagues enjoy their work and develop their careers.  People who consider others before making decisions.</b> </div><div><br></div><div>At DAZN, we are committed to fostering an inclusive environment that values equality and diversity, where everyone can contribute and have their voices heard. This means hiring and developing talent across all races, ethnicities, religions, age groups, sexual orientations, gender identities and abilities. </div><div><br></div><div>Everyone has the opportunity to make change and impact our DEI journey by joining our ERGs: Proud@DAZN, Women@DAZN, Disability@DAZN and ParentZone.</div><div> </div><div>If you’d like to include a cover letter with your application, please feel free to. Please do not feel you need to apply with a photo or disclose any other information that is not related to your professional experience.</div><div> </div><div>Our aim is to make our hiring processes as accessible for everyone as possible, including providing adjustments for interviews where we can.</div><div> </div><div>We look forward to hearing from you.</div><img src=\"https://remotive.com/job/track/1927916/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1927917,
    "url": "https://remotive.com/remote-jobs/design/3d-fantasy-character-artist-1927917",
    "title": "3D Fantasy Character Artist",
    "company_name": "Kokku Games",
    "company_logo": "https://remotive.com/job/1927917/logo",
    "category": "Design",
    "tags": [
    "healthcare",
    "SOLID",
    "insurance"
    ],
    "job_type": "full_time",
    "publication_date": "2024-08-06T08:50:46",
    "candidate_required_location": "Portugal",
    "salary": "",
    "description": "<p>Join us at Kokku Games as a 3D Fantasy Character Artist and bring fantastical characters to life. As an artist, you will be responsible for creating realistic fantasy characters. You are an experienced and skilled professional who can guarantee the creation of prime quality assets that can work in a dynamic environment with an open mindset for providing solutions and excellence.</p><p>Being a part of Kokku means being able to work with a commitment to excellence. As a result, we put our talents and efforts into making games better. In addition, only at Kokku Games will you have the opportunity to work with great IPs and major studios like Activision, Guerrilla Games, Netflix, Warner Brothers, and Treyarch, to name a few.</p><p>At Kokku, we believe in pushing boundaries and crafting remarkable experiences for players.</p><p></p><p><strong>As a 3D Fantasy Character Artist, you will:</strong></p><ul style=\"\"> <li style=\"\">Develop and deliver in-game characters within technical requirements following concept art and art direction.</li> <li style=\"\">Participate actively in establishing benchmarks in technical and visual quality and optimal cost of effort.</li> <li style=\"\">Collaborate with team members in a constant effort to improve overall quality.</li> <li style=\"\">Set ambitious personal goals to enhance efficiency and meet deadlines.</li> <li style=\"\">Work closely with the Art Director and lead in establishing regulations and standards with the benchmarks.</li> <li style=\"\">Adapt art direction requirements to styles and pipelines required for the mandate.</li> <li style=\"\">Act as an example and be a role model for your peers.</li> <li style=\"\">Create and not be limited to character, garments, grooming, gears, and skins following art direction references concerning technical requirements, animation constraints, and specifications.</li> <li style=\"\">Participate actively in establishing benchmarks in technical and visual quality and optimal cost of effort.</li> <li style=\"\">Collaborate with team members in a constant effort to improve overall quality.</li> <li style=\"\">Set ambitious personal goals to improve efficiency and meet deadlines.</li> <li style=\"\">Create in various styles, from realistic to stylized.</li> <li style=\"\">Work closely with the Art Director and lead in establishing regulations and standards with the benchmarks.</li> <li style=\"\">Adapt art direction requirements to styles and pipelines required for the mandate.</li> <li style=\"\">Act as an example and be a role model for your peers.</li> </ul><p><strong>Requirements</strong></p><ul style=\"\"> <li style=\"\">Experience with fantasy-style</li> <li style=\"\">Experience with game asset creation constraints.</li> <li style=\"\">Experience in texture creation.</li> <li style=\"\">Understanding of requirements related to creating realistic in-game characters;</li> <li style=\"\">Confident SubD modeling in Max / Maya;</li> <li style=\"\">Experience sculpting in Zbrush;</li> <li style=\"\">Solid skill in creating low-poly models and retopology, understanding of the principles of modular systems, and the ability to optimally distribute polygons on the asset;</li> <li style=\"\">An ability to develop optimal UV mapping respecting technical restriction</li> <li style=\"\">Experience in texturing in Substance Painter;</li> <li style=\"\">Have skills in importing and setting 3D models and materials in-game engines.</li> <li style=\"\">An ability to follow and correctly interpret/improve the concept idea;</li> <li style=\"\">Excellent communication and teamwork skills, proactiveness, and desire to learn and share.</li> <li style=\"\">Intermediate level of English, in reading and speaking.</li> </ul><p><strong>Benefits</strong></p><ul style=\"\"> <li style=\"\">Competitive financial reward;</li> <li style=\"\">Health Insurance;</li> <li style=\"\">A transparent and inclusion-oriented culture;</li> <li style=\"\">Relocation bonus,</li> <li style=\"\">Meal ticket;</li> <li style=\"\">Transport benefits and more;<a class=\"external\" href=\"https://kokku.com.br/career/\" rel=\"nofollow\"></a> </li> <li style=\"\">A full-time job in a modern and relaxed studio atmosphere;</li> <li style=\"\">A chance to work in a booming industry, within an international team;</li> <li style=\"\">Private healthcare &amp; Multisport card;</li> <li style=\"\">A lot of challenges and ambitious tasks;</li> <li style=\"\">An opportunity to grow in a stimulating industry.</li> </ul><img src=\"https://remotive.com/job/track/1927917/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1927918,
    "url": "https://remotive.com/remote-jobs/design/graphic-designer-1927918",
    "title": "Graphic Designer",
    "company_name": "Coastline Equity",
    "company_logo": "https://remotive.com/job/1927918/logo",
    "category": "Design",
    "tags": [
    "adobe creative suite",
    "graphic design",
    "time management"
    ],
    "job_type": "part_time",
    "publication_date": "2024-08-06T04:50:54",
    "candidate_required_location": "Ecuador",
    "salary": "competitive salary",
    "description": "<p><strong>Company Culture</strong></p><p>We are a virtual team of three women working remotely from different parts of the country. Our brand agency scales as needed, leveraging resources for web development, animation, and design support. We believe in good, clean, and fun design, doing good work for good people, and timelessness over trends. Simplicity is key—less is always more. We are dedicated to top-quality design and branding, passionate about simple logo marks, inspired by California vibes, and prioritize function over frills. We are not pretentious, do not white-label overseas designers, and focus on quality over quantity, not handling social media. Our culture is built on excellence, simplicity, and timeless design.</p><p></p><p><strong>Summary &amp; Objectives</strong></p><p>We are seeking a creative and dedicated Associate Designer to join our Client's team at Stellen Design. This part-time position, requiring 20 hours per week, is ideal for a talented designer looking to contribute to a variety of projects while freeing up time for their senior designer to focus on larger initiatives. Your role will involve handling smaller design projects and requests, ensuring that nothing slips through the cracks, and maintaining a high standard of quality and efficiency in all your work.</p><p></p><p><strong>Key Responsibilities &amp; Functions </strong></p><ol style=\"\"> <li style=\"\">Complete graphic design projects for clients and our company, taking content and re-laying it out for different social platforms.</li> <li style=\"\">Manage and execute small design requests and projects promptly and accurately.</li> <li style=\"\">Use the Adobe Creative Suite (Illustrator, XD, Photoshop, InDesign) to create high-quality designs.</li> <li style=\"\">Follow directions carefully and ensure prompt completion of tasks.</li> <li style=\"\">Maintain a good eye for design and ask questions if any direction or edits are unclear.</li> <li style=\"\">Collaborate with the senior designer and the administrative assistant, Carolina, to ensure smooth project workflow.</li> </ol><p><strong>Requirements</strong></p><ul style=\"\"> <li style=\"\">At least 2 years of experience in graphic design.</li> <li style=\"\">Proven experience as a designer, with a strong portfolio showcasing your skills.</li> <li style=\"\">Familiarity with various social media platforms and the ability to adapt designs accordingly.</li> <li style=\"\">Experience using Adobe Creative Suite (Illustrator, XD, Photoshop, InDesign) is essential.</li> </ul><p></p><p><strong>Skill &amp; Competencies</strong></p><ul style=\"\"> <li style=\"\">Proficiency in Adobe Creative Suite (Illustrator, XD, Photoshop, InDesign).</li> <li style=\"\">Strong attention to detail and ability to follow directions accurately.</li> <li style=\"\">A good eye for design and creativity.</li> <li style=\"\">Excellent communication skills and the ability to ask questions when clarification is needed.</li> <li style=\"\">Ability to work independently and manage time effectively.</li> <li style=\"\">Professionalism and promptness in completing tasks.</li> </ul><p><strong>Benefits</strong></p><ul style=\"\"> <li style=\"\">20 hours a week position with competitive salary.</li> <li style=\"\">Opportunity for growth and advancement within the company.</li> <li style=\"\">Training and support provided to help you succeed in your role.</li> </ul><br><br><div class=\"h2\">About the company</div><br><p>At Coastline Equity, we specialize in comprehensive property management services for commercial and multifamily properties. With over<strong> <strong>50 years of experience</strong></strong> in the real estate industry, our seasoned professionals bring invaluable expertise and insights into market dynamics to help you achieve your financial goals.</p><p>We take a personalized approach to every project, learning your unique needs and future goals to provide practical advice on the best course of action. Partner with us to benefit from our proven track record of success and dedication to building long-term relationships with our clients.</p><img src=\"https://remotive.com/job/track/1927918/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1927919,
    "url": "https://remotive.com/remote-jobs/design/junior-graphic-designer-1927919",
    "title": "Junior Graphic Designer",
    "company_name": "Apothekary",
    "company_logo": "https://remotive.com/job/1927919/logo",
    "category": "Design",
    "tags": [
    "social media",
    "adobe creative suite",
    "graphic design"
    ],
    "job_type": "full_time",
    "publication_date": "2024-08-05T16:50:24",
    "candidate_required_location": "USA",
    "salary": "",
    "description": "<p><img height=\"421px\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXeokt5NbxefzNO56wXj8SKkD6G5r3wg5vTb-dcXjl4qCBIdD-0kWGdi-5xV8dgBJqALPsb1YiBhVrv7tV9XZc90N0b3AMpNZYc9P42yxIouYEBvXZqAd65UkMDOkjIGKX7BEVKlXWJuLo4sOdN698QRkvej?key=-RwwmOmAbt1jH4em65FkAw\" style=\"width:624px;height:421px;\" width=\"624px\"></p><p></p><p>Welcome to <a class=\"external\" href=\"http://apothekary.co\" rel=\"nofollow\">Apothékary</a>, where Nature is Medicine™. We harness the intelligence of nature by creating clean, effective herbal remedies that target the root cause of health imbalances like helping to ease stress, support the gut, strengthen immunity, boost energy, and sharpen mental focus. Our herbal formulas feature traditional herbs from several medicinal modalities including Ayurveda, traditional Chinese medicine (TCM), Japanese Kampo, and Western herbalism. We believe in getting to the root cause of health issues and herbs can be a great place to start your journey and promote wellness for the long-term. </p><p></p><p>We were founded in early 2019 by Shizu Okusa, a serial entrepreneur in the wellness industry and named E&amp;Y’s <a class=\"external\" href=\"https://www.ey.com/en_us/news/2021/08/ey-announces-winners-for-the-eoy-2021-mid-atlantic-award\" rel=\"nofollow\">Entrepreneur of the Year 2021</a>. After leaving an intense finance career, she became inspired to live a more balanced lifestyle and revisit her Japanese roots and passion for herbal medicine. Shizu set out to help others regain their holistic health using traditions she grew up with and ones she learned along the way.</p><p></p><div class=\"h3\">Why work with us?</div><ol style=\"\"> <li style=\"\">You will get the chance to be an early team member at a fast-growth consumer health &amp; wellness brand disrupting the intersection of food, beauty and medicine – preventative healthcare rooted in plant medicine that makes one beautiful from the inside out. </li> <li style=\"\">We are growing fast (100x growth in two years, over $12M in capital raised, and quadrupled the size of the team in the last 9 months)</li> <li style=\"\">We’re a tight-knit, passionate team, where you'll learn a ton and have ownership over your responsibilities.</li> <li style=\"\">Work with a seasoned second-time founder and executive team</li> </ol><p></p><div class=\"h3\">The role:</div><p>We are looking for a highly motivated and proactive Junior Graphic Designer with an impeccable attention to detail and strong design sense to join our Creative team. This role is perfect for a creative individual who is passionate about design and eager to develop their skills across various disciplines. The ideal candidate will have a keen eye for detail, strong sense of aesthetics, and the ability to work collaboratively in a fast-paced environment. This position reports to the Lead Graphic Designer and will work very closely with the Creative Strategist</p><p></p><div class=\"h3\">Responsibilities:</div><ul style=\"\"> <li style=\"\">Develop and design print and digital media including marketing materials, including packaging, labels, brochures, and social media graphics, web, email and digital ads</li> <li style=\"\">Collaborate with Brand Marketing to produce engaging visual content that aligns with our brand identify and marketing goals</li> <li style=\"\">Create Amazon requests including Hero images, carousel images, A+ content, and brand updates</li> <li style=\"\">Design assets for Paid ads, including Meta, Pinterest, TikTok, Google, etc</li> <li style=\"\">Handle membership requests by designing PDP images and direct mailers</li> <li style=\"\">Develop Instagram requests such as IG Stories, giveaway assets, launch posts, and updating profile pictures based on launches</li> <li style=\"\">Design custom event collateral including product intro cards, welcome signs, etc</li> <li style=\"\">Implement complaint updates for packaging, including SFTs, distributor information, barcodes, etc</li> <li style=\"\">Support with retail creative needs including POS materials, collateral, and other related tasks</li> <li style=\"\">Ensure all design work adheres to brand guidelines and maintains a consistent look and feel across all mediums</li> <li style=\"\">Ability to manage multiple priorities efficiently and effectively, making timely decisions to meet project deadlines and business needs</li> <li style=\"\">Work closely with the product development and marketing team to understand project requirements and objectives</li> <li style=\"\">Maintain quality, organization and proper optimization for all digital platforms</li> <li style=\"\">Experienced in photo retouching, photo-manipulation and compositing</li> <li style=\"\">Retouch artwork according to the creative recommendations and production specifications and expectations</li> <li style=\"\">Responsible of upholding design/brand standards and file naming conventions</li> <li style=\"\">Brainstorm with marketing team and ability to collaborate with various teams to conceptualize creative graphic communications fulfilling project objectives</li> <li style=\"\">Stay up-to-date on latest industry standards and trends tools, and technologies to bring fresh ideas and innovative design solutions to the team</li> <li style=\"\">Propose new design concepts and strategies to enhance brand presence</li> <li style=\"\">Other assignments and projects as assigned</li> </ul><p></p><div class=\"h3\">Time and Location: </div><p>This is a full-time and fully remote W2 role. Our team primarily works off of Eastern Time between 9:00am-5:00pm. Flexibility will be allowed between those hours, but this role will work closely in collaboration with the full time team and therefore would be expected to work between those regular daytime hours.  </p><p><br>This position is available to start immediately. Applications without a portfolio will not be considered. Note that job responsibilities may change based on the company’s evolving needs.  </p><p><strong>Requirements</strong></p><p></p><ul style=\"\"> <li style=\"\">Bachelor’s degree in Graphic Design, Visual Communication, or related field</li> <li style=\"\">1-2 years of hands-on graphic design experience, preferably in a multidisciplinary role</li> <li style=\"\">Proficiency in Adobe Creative Suite (Illustrator, Photoshop, InDesign), Canva, Figma</li> <li style=\"\">Understanding of social media platforms (Facebook, LinkedIn, Pinterest, TikTok, YouTube)</li> <li style=\"\">Preferably CPG industry and start-up experience</li> <li style=\"\">Strong understanding of typography, color theory, and layout principles</li> <li style=\"\">Ability to take constructive feedback and iterate on designs</li> <li style=\"\">Unquestionable ethics that drive leadership and behavior</li> <li style=\"\">You consider yourself an outstanding communicator, capable of engaging with all organizational level</li> <li style=\"\">Creative thinking with a problem-solving mindset</li> <li style=\"\">Meticulous attention to detail with a strong commitment to quality</li> <li style=\"\">Ability to work independently as well as part of a team</li> <li style=\"\">Passion for wellness community and herbal medicine</li> </ul><p></p><div class=\"h3\">Bonus points:</div><ul style=\"\"><li style=\"\">Motion Design and Video editing skills</li></ul><p><strong>Benefits</strong></p><p></p><ul style=\"\"> <li style=\"\">Medical, vision and dental plan</li> <li style=\"\">Monthly paid Mental Health Days</li> </ul><br><br><div class=\"h2\">About the company</div><br><p><img alt=\"\" height=\"262\" src=\"https://workablehr.s3.amazonaws.com/uploads/photos/600405/c537281c69a6c34378fc4aad0e0d8b41.jpg\" style=\"width: 516px; height: 262px;\" title=\"Apothékary™ - Where Nature is Medicine™.\" width=\"516\"></p><p>Apothékary started with our founder, Shizu Okusa, and her family’s traditional Japanese approach to healing — using nature as medicine instead of over-the-counter fixes. In many Eastern cultures, traditional medicine in the form of plants and herb has been used for centuries to address the root cause of common ailments. <br></p><p>That’s exactly what we strive to do here at Apothékary - we’re here to not just treat the symptom, but get to the root cause of your wellness woes. </p><p>\nThe demands of our modern life disconnect us from our inherent state of being. At times, we can forget what it feels like to live in harmony with the natural world. Ancient healing traditions take cues from nature to holistically support our mind, body, and spirit. With daily practice, we’re reminded of what harmony feels like and we wonder how we ever lived without it. </p><p>\nApothékary is on a mission to give ancient, plant-based healing traditions new life—so that you can live a more balanced one. All of our Signature Formulas are thoughtfully formulated by our in-house Clinical Herbalists, pulling from traditional medicine modalities like Japanese Kampo, Traditional Chinese Medicine, Ayurveda, and American herbalism. The result is simple yet effective herbal remedies with tradition and modern science in mind. </p><p>\nEach formula contains herbs from local and global farmers with ingredients that are non-GMO, gluten-free, and contain no added sugar, fillers, or additives. In essence, they’re nature’s best remedies—plain and simple. And the best part is, they actually work to address the root cause instead of masking the symptoms. </p><p>\nCome with us and reembark on your journey back to balance with Apothékary.<br></p><img src=\"https://remotive.com/job/track/1927919/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1927923,
    "url": "https://remotive.com/remote-jobs/design/senior-digital-ux-ui-designer-1927923",
    "title": "Senior Digital + UX/UI Designer",
    "company_name": "103644278",
    "company_logo": "https://remotive.com/job/1927923/logo",
    "category": "Design",
    "tags": [
    "Figma",
    "adobe creative suite"
    ],
    "job_type": "full_time",
    "publication_date": "2024-08-05T06:50:24",
    "candidate_required_location": "USA",
    "salary": "$110,000-$115,000",
    "description": "<div class='\"content-intro\"'><p>Lume is on a mission to normalize body odor beyond the pits and provide people with outrageously effective solutions so they never have to think twice about odor! Our Whole Body Deodorants can be used for any unwanted odor—from pits, to privates and beyond. It’s doctor-developed, made with skin-safe ingredients that are gentle enough for the most sensitive parts and clinically proven to control any external B.O. for 72 hours. In 2023, we launched a men’s line called Mando.  Mando uses the same technology as Lume but has different scent profiles.</p>\n<p>We are a 6-year-old fast growing, omni-channel deodorant and personal care brand that’s transforming the way that humans do hygiene. We joined forces with Harry’s, another disruptive brand with great people and infrastructure, to accelerate our growth. We are a team of self-starters that roll up our sleeves and get it done. Our style is collaborative and very fast-paced so an adaptive personality is a must.</p></div><p><strong>About Harry’s </strong></p>\n<p>Harry’s Inc. is building a modern CPG company by putting people first and delivering against real unmet consumer needs.<br><br>The company’s flagship brand - Harry’s -  was founded by Jeff Raider and Andy Katz-Mayfield in 2013. After successfully launching and scaling Harry’s, Jeff and Andy saw an opportunity to bring their experience building Harry’s to other CPG categories where the consumer has also been historically underserved.<br><br>Harry’s Inc. has grown significantly over the last ten years, and is now made up of four brands -  Harry’s, Flamingo, Lume, Mando -  and Harry’s Labs, the company’s incubation and M&amp;A engine. The company employs more than 900 people across the U.S., U.K. and Germany, and is the largest CPG company built in the last 20 years.<br><br>At Harry’s Inc, our mission is to Create Things People Like More — whether it's a product, an experience, or an internal tool, we believe in making the things around us better for our customers, and our team.<br><br>Our mission extends beyond customers and team, to the community broadly. We believe that the best business models make a positive impact. So, we set aside 1% of sales across Harry’s, Flamingo, and Lume to support our social mission, including through donations to our nonprofit partners.<br><br>At the end of the day, the key to our success is our amazing people. From chemists, mechanical engineers, CX associates, to creative directors, sourcing managers, and logistics specialists, the Harry’s team is composed of some of the most brilliant, diverse, and humble people you’ll ever meet. Our company is a place of inclusion, innovation, and deeply ingrained values.</p>\n<p> </p>\n<p>We’re excited to add a Senior Digital + UX/UI Designer to the team! The ideal candidate is equally adept at both layers of design.</p>\n<p> </p>\n<p>Responsibilities</p>\n<ul style=\"\">\n<li style=\"\">Work within brand guidelines to execute layouts and generate optimized assets that reinforce Lume’s brand voice through its direct-to-consumer touchpoints</li>\n<li style=\"\">Work closely to support the UX/UI design manager to conceptualize and execute website designs, design systems, new features, and experiments for the Lume and Mando brands</li>\n<li style=\"\">Work cross functionally with Product Management, Engineering, Conversion Rate Optimization, Brand Creative, and Consumer Insights</li>\n<li style=\"\">Create multiple design iterations and explorations for all projects</li>\n<li style=\"\">Present design iterations fluently, communicating design rationale, tradeoffs and technical feasibility</li>\n<li style=\"\">Analyze and synthesize qualitative data via user testing, heatmaps, scrollmaps and session recordings to help inform design decisions</li>\n<li style=\"\">Create polished, development-ready comps and prototypes along with redlines and annotations to communicate effectively and efficiently with Engineering</li>\n<li style=\"\">Perform quality assurance on creative, copy, and download speed</li>\n<li style=\"\">Participate in strategic digital ideation initiatives </li>\n<li style=\"\">Retouch and edit all forms of imagery and vectors as needed</li>\n<li style=\"\">Generate creative assets under tight deadlines </li>\n</ul>\n<p> </p>\n<p>Skills And Qualifications</p>\n<ul style=\"\">\n<li style=\"\">Bachelor’s degree in graphic or communication design</li>\n<li style=\"\">5+ years of experience in ecommerce</li>\n<li style=\"\">3+ years experience in Figma</li>\n<li style=\"\">2+ years of experience with design systems</li>\n<li style=\"\">5+ years of experience in Adobe Creative Suite, particularly Photoshop and Illustrator</li>\n<li style=\"\">Strong understanding of web best practices: responsive design, UI patterns, usability, accessibility, and file formats</li>\n<li style=\"\">Strong understanding of core graphic design principles: layout, hierarchy, color and typography and how it applies to the web</li>\n<li style=\"\">Open minded with a high level of curiosity, iterates rapidly</li>\n<li style=\"\">Synthesizes and balances creative with business requirements, user scenarios, and technical feasibility</li>\n<li style=\"\">Comfortable with delegated tasks and can also work autonomously or with minimal supervision </li>\n<li style=\"\">Proactive and a self-starter, seeks out clarity in the face of ambiguities, frequently goes above and beyond</li>\n<li style=\"\">Low ego and a can do attitude team player, is flexible and pivots gracefully</li>\n<li style=\"\">Sense of humor and the ability to have fun doing what you love</li>\n<li style=\"\">Bonus points</li>\n<ul style=\"\">\n<li style=\"\">Beauty or CPG experience</li>\n<li style=\"\">Basic HTML/CSS coding</li>\n<li style=\"\">Animation/motion graphics</li>\n<li style=\"\">Adobe Substance or similar 3D software</li>\n</ul>\n</ul>\n<p> </p>\n<p>Please provide a current portfolio (URL and password if applicable) that demonstrates a thorough understanding of modern responsive web design and skillful use of core graphic design principles.</p>\n<p> </p>\n<p><strong>Benefits and perks</strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Medical, dental, and vision coverage</strong></li>\n<li style=\"\"><strong>401k match</strong></li>\n<li style=\"\"><strong>Equity in Harry’s </strong></li>\n<li style=\"\"><strong>Flexible time off and working hours</strong></li>\n<li style=\"\"><strong>Wellness and L&amp;D stipends</strong></li>\n<li style=\"\"><strong>4 weeks sabbatical after 5 years, 6 weeks after 10 years, and 8 weeks after 15 years </strong></li>\n<li style=\"\"><strong>Up to 20 weeks of pregnancy leave and up to 16 weeks of parental leave</strong></li>\n<li style=\"\"><strong>Fun IRL and virtual events including happy hours, team building events, and parties on our rooftop</strong></li>\n<li style=\"\"><strong>Free products from all of our brands</strong></li>\n</ul>\n<p> </p>\n<p><strong>Harry’s is committed to bringing together individuals from different backgrounds and perspectives. We strive to create an inclusive environment where everyone can thrive, feel a sense of belonging, and do great work together.</strong></p>\n<p><strong>Harry’s is an Equal Opportunity Employer, providing equal employment and advancement opportunities to all individuals. We recruit, hire and promote into all job levels the most qualified applicants without regard to race, color, creed, national origin, religion, sex (including pregnancy, childbirth and related medical conditions), parental status, age, disability, genetic information, citizenship status, veteran status, gender identity or expression, transgender status, sexual orientation, marital, family or partnership status, political affiliation or activities, military service, domestic violence victim status, arrest/conviction record, sexual or reproductive health decisions, caregiver status, credit history immigration status, unemployment status, traits historically associated with race, including but not limited to hair texture and protective hairstyles or any other status protected under applicable federal, state and local laws. Harry’s commitment to providing equal employment opportunities extends to all aspects of employment, including job assignment, compensation, discipline and access to benefits and training.</strong></p>\n<p><strong>We respect the laws enforced by the EEOC and are dedicated to going above and beyond in fostering diversity across our company.</strong></p>\n<p><span style='\"font-weight:'>We can’t quantify all of the intangible things we think you’ll love about working at Harry’s, like the exciting challenges we tackle, the smart and humble team you’ll get to work with, and our supportive and inclusive culture. That said, our salary ranges are based on paying competitively for our size and industry, and are one part of our total rewards package, which also includes a comprehensive set of </span><a href=\"%22https://www.harrys.com/en/us/careers%22\" rel=\"nofollow\"><span style='\"font-weight:'>benefits</span></a><span style='\"font-weight:'> and our equity program. The base salary hiring range for this position is </span><span style='\"font-weight:'>$110,000-$115,000</span><span style='\"font-weight:'>, but the final compensation offer will ultimately be based on the candidate’s location, skill level and experience.  </span></p>\n<p><em>This role can be done remotely, however there may be location constraints based on where Harry's is registered and able to employ individuals. Please work with your recruiter and your hiring manager to understand any location constraints. We are authorized and able to employ individuals in many, but not all states. If you are not located in or able to work from a state where we are registered or able to employ individuals, you will not be eligible for employment. Please speak with your recruiter to learn more. </em></p>\n<p><em>#BI-Remote #LI-Remote </em></p>\n<p class='\"p1\"'>#LI-132397471_HS1</p><div class='\"content-conclusion\"'><p><strong>Lume is committed to bringing together individuals from different backgrounds and perspectives. We strive to create an inclusive environment where everyone can thrive, feel a sense of belonging, and do great work together. As an equal opportunity employer, we prohibit any unlawful discrimination against a job applicant on the basis of their race, color, religion, veteran status, sex, parental status, gender identity or expression, transgender status, sexual orientation, national origin, age, disability or genetic information. We respect the laws enforced by the EEOC and are dedicated to going above and beyond in fostering diversity across our company.</strong></p></div><img src=\"https://remotive.com/job/track/1927923/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1924704,
    "url": "https://remotive.com/remote-jobs/design/product-designer-1924704",
    "title": "Product Designer",
    "company_name": "Contra",
    "company_logo": "https://remotive.com/job/1924704/logo",
    "category": "Design",
    "tags": [
    "UI/UX"
    ],
    "job_type": "part_time",
    "publication_date": "2024-07-16T18:00:55",
    "candidate_required_location": "Worldwide",
    "salary": "$60 - $80/hr ",
    "description": "<p>We are seeking a part-time product designer to join our team at Contra. The ideal candidate will help craft new user experiences for our platform, focusing on our independent side products. This role is perfect for someone passionate about design and looking to make a significant impact in a flexible work environment.</p>\n<p> </p>\n<p> </p>\n<p><strong>*The is a part-time contract for ~20 hours / week. </strong></p>\n<p><strong> </strong></p>\n<div class=\"h4\" id=\"8233b36f-c951-4846-83f9-9f4c0aae9da4\">Responsibilities:</div>\n<ul class=\"_listContainer_1wyhh_1\" style=\"\">\n<li style=\"\">Design intuitive and effective UX flows for new products.</li>\n<li style=\"\">Collaborate with the product team to understand requirements and user needs.</li>\n<li style=\"\">Contribute to the creative process with fresh ideas and perspectives.</li>\n<li style=\"\">Deliver high-quality design solutions that align with project goals.</li>\n<li style=\"\">Ensure all design deliverables are completed within the established timeframe.</li>\n<li style=\"\">Collaborate with the Product team to identify user and business needs.</li>\n<li style=\"\">Add to our growing design system.</li>\n<li style=\"\">Apply your design thinking skills to other touchpoints (marketing, social, etc.). </li>\n</ul>\n<img src=\"https://remotive.com/job/track/1924704/blank.gif?source=public_api\" alt=\"\"/>",
    "company_logo_url": "https://remotive.com/job/1924704/logo"
    },
    {
    "id": 1919266,
    "url": "https://remotive.com/remote-jobs/design/senior-independent-ux-ui-designer-1919266",
    "title": "Senior Independent UX/UI Designer",
    "company_name": "A.Team",
    "company_logo": "https://remotive.com/job/1919266/logo",
    "category": "Design",
    "tags": [
    "go",
    "UI/UX",
    "wordpress",
    "chat",
    "apple",
    "testing",
    "catalyst"
    ],
    "job_type": "contract",
    "publication_date": "2024-07-16T10:16:04",
    "candidate_required_location": "USA timezones, European timezones",
    "salary": "$90 - $150 /hour",
    "description": "<p style=\"text-size-adjust: 100%; overflow-wrap: break-word;\"><a href=\"https://build.a.team/remotivedesignerreferral\" rel=\"nofollow\">A·Team</a> is a VC-backed, stealth, application-only home on the internet for Senior Independent UX/UI Designers (along with developers &amp; product managers) to team up with hand-picked, high-growth companies on their next big thing. </p>\n<p style=\"text-size-adjust: 100%; overflow-wrap: break-word;\">After talking with hundreds of independent engineers, designers, and product folks, we heard over and over that finding vetted, high-quality, consistent clients is hard, and projects are often too small to be rewarding. A·Team matches small teams of the most talented builders in the world with companies backed by a16z, YC, Softbank, General Catalyst, etc. on a contract basis for many of their most important initiatives. We quietly launched in May 2020, and have helped A·Teamers earn $85MM+ since.</p>\n<p dir=\"ltr\" style=\"margin-top: 12pt; margin-bottom: 12pt; line-height: 1.38;\"><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\"><em>As part of A·Team, you can expect:</em></span></p>\n<ul style=\"\">\n<li style=\"\"><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">High-paying, meaningful missions with the most audacious companies</span> sent your way; generally $90-$150/hr, with vetted, fascinating clients doing work that matters. We're picky about who we partner with; new clients only come in via trusted referral. We've worked with Lyft, McGraw Hill, ClearCo, Pepsi, Walmart, Endeavor, Post News (the former CEO of Waze), the leading vaccine production software, several new unicorns we can't say here, and dozens of startups backed by a16z/YC/Softbank/etc.</li>\n<li style=\"\"><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">Work alongside friends old &amp; new: </span>our niche is small/diverse product teams, since clients with larger budgets and higher-impact work tell us they want teams, not individuals. Of course, we keep friends together whenever we can.</li>\n<li style=\"\"><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">Full autonomy:</span> say \"no\" to things that don't excite you. The most talented builders often juggle a few things at once, so there's never pressure to join an A·Team mission if you don't have the bandwidth. If we're no longer a fit, it's easy to leave or pause too. </li>\n<li style=\"\"><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">Small, curated, off-the-record gatherings:</span> for conversations hard to have elsewhere. Long-term, we're creating micro-communities for the world's top builders to become friends around the things they care about.</li>\n<li style=\"\"><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">Keep 100% of what you earn: </span>if you charge $120/hr, you get $120/hr. A·Team makes money by charging a small, flat, transparent platform fee on <em>top</em> of your rate.</li>\n</ul>\n<p dir=\"ltr\" style=\"margin-top: 12pt; margin-bottom: 12pt; line-height: 1.38;\"><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\"><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">How to apply:</span></span></p>\n<p dir=\"ltr\" style=\"margin-top: 12pt; margin-bottom: 12pt; line-height: 1.38;\"><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\">Go here: <a href=\"https://build.a.team/remotivedesignerreferral\" rel=\"nofollow\">https://build.a.team/remotivedesignerreferral</a> + mention Remotive. </span>We respect your time so the application is short. We're also much more interested in seeing what you've made, and excited to chat more if there’s a fit.</p>\n<p dir=\"ltr\" style=\"margin-top: 12pt; margin-bottom: 12pt; line-height: 1.38;\"><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\"><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">What you’ll do:</span></span></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"margin-top: 12pt; margin-bottom: 0pt; line-height: 1.38;\"><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\">Once part of A.Team, you’ll regularly be invited to impactful missions that match your interests. Take your pick from early-stage incubations with world-class founders, to fast-growing super-funded companies, to old school non-tech incumbents looking to build as a tech giant would</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"margin-top: 0pt; margin-bottom: 0pt; line-height: 1.38;\"><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\">Missions usually involve building an ambitious piece of software from 0 to 1 as part of a small 3-4 person team. </span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"margin-top: 0pt; margin-bottom: 12pt; line-height: 1.38;\"><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\">You’ll be paid to scope it out, give the client options, guide strategy, and execute on the selected solution. Sometimes the client has a clear vision, sometimes not; which is why A.Team builders tend to be senior folks who can work together to find the right direction. </span></p>\n</li>\n</ul>\n<p dir=\"ltr\" style=\"margin-top: 12pt; margin-bottom: 12pt; line-height: 1.38;\"><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\"><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\">Who A</span><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\">·</span><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\">Team is for:</span></span></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"margin-top: 12pt; margin-bottom: 0pt; line-height: 1.38;\"><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\">Senior UX/UI Designers who left large companies and high-growth startups to pursue their craft with autonomy.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"margin-top: 0pt; margin-bottom: 0pt; line-height: 1.38;\"><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\">Those who prefer consistent contract work over a full-time role, who want to create a variety of new products alongside other top-tier builders.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"margin-top: 0pt; margin-bottom: 12pt; line-height: 1.38;\"><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\">The majority of A.Teamers spend most of their time doing independent work, but a sizeable percentage are either employed full-time (but testing out client work), bootstrapping a side project, or looking for their next big thing</span></p>\n</li>\n</ul>\n<p dir=\"ltr\" style=\"margin-top: 12pt; margin-bottom: 12pt; line-height: 1.38;\"><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\"><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\">Who A</span><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\">·</span><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\">Team is </span><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\">not</span><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\"> for:</span></span></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"margin-top: 12pt; margin-bottom: 0pt; line-height: 1.38;\"><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\">People looking for small gigs</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"margin-top: 0pt; margin-bottom: 0pt; line-height: 1.38;\"><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\">Folks looking to build simple wordpress/wix/squarespace-style websites</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"margin-top: 0pt; margin-bottom: 12pt; line-height: 1.38;\"><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\">Those still early in their careers (&lt;4 years) and recent university/bootcamp grads (at least not yet)</span></p>\n</li>\n</ul>\n<p dir=\"ltr\" style=\"margin-top: 12pt; margin-bottom: 12pt; line-height: 1.38;\"><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\"><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">Our long-term vision:</span></span></p>\n<p dir=\"ltr\" style=\"margin-top: 12pt; margin-bottom: 12pt; line-height: 1.38;\"><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\"><a href=\"https://build.a.team/remotivedesignerreferral\" rel=\"nofollow\">A·Team</a> is a new type of company for a new kind of independent software builder. We call them \"unhirables\": people who traditional companies couldn’t hire full-time even if they wanted to, but who want to do their most meaningful work with their favorite people in small, autonomous, distributed expert teams. </span></p>\n<p dir=\"ltr\" style=\"margin-top: 12pt; margin-bottom: 12pt; line-height: 1.38;\"><span style=\"font-variant-numeric: normal; font-variant-east-asian: normal; vertical-align: baseline;\">To help us secure amazing missions, we raised $60 million+ from Insight Ventures, Tiger Global, NFX, RocNation, along with the former CEO of Upwork, the founders of Fiverr and Lemonade, Apple's Global Head of Recruiting, YC Partner Aaron Harris, Wharton's Adam Grant, and Duke's Dan Ariely.</span></p>\n<img src=\"https://remotive.com/job/track/1919266/blank.gif?source=public_api\" alt=\"\"/>",
    "company_logo_url": "https://remotive.com/job/1919266/logo"
    }
    ]
    }