{
    "00-warning": "Remotive main domain moved to remotive.com ! Please make your API calls on remotive.com/api/remote-jobs instead of remotive.io now ;) Legacy endpoint remotive.io/api/remote-jobs will be terminated in June 2022. Thank you!",
    "0-legal-notice": "Legal warning - Hey, thanks for using Remotive's API, we appreciate it! Please note that API documentation and access is granted so that developers can share our jobs further. Please do not submit Remotive jobs to third Party websites, including but not limited to: Jooble, Neuvoo, Google Jobs, LinkedIn Jobs. Please link back to the URL found on Remotive AND mention Remotive as a source in order to Remotive to get traffic from your listing. If you don't do that, we'll terminate your API access, sorry! Jobs displayed are delayed by 24 hours, the goal being that jobs are attributed to Remotive on various platforms. Displaying our jobs in order to collect signups/email addresses to show a listing constitutes a breach of our terms of services. We offer a private, paid-for API, please email us at hello(at)remotive(dot)io for more information (starting budget is $5k/mo). Please find out terms of services on https://remotive.com/api-documentation. Please note that there is absolutely no need to request Remotive Job data too frequently. Typically, you only need to GET Remotive job data through this API a couple of times a day (we advise max. 4 times a day). Our data is not changing much faster than that anyway. Note that excessive requests will be blocked. Many thanks (Rodolphe & the Remotive team!)",
    "job-count": 10,
    "jobs": [
    {
    "id": 1928595,
    "url": "https://remotive.com/remote-jobs/marketing/executive-director-therapeutics-marketing-1928595",
    "title": "Executive Director, Therapeutics Marketing",
    "company_name": "Revance",
    "company_logo": "https://remotive.com/job/1928595/logo",
    "category": "Marketing",
    "tags": [
    "marketing strategy"
    ],
    "job_type": "full_time",
    "publication_date": "2024-08-07T10:51:03",
    "candidate_required_location": "USA",
    "salary": "$195,000 - $280,000",
    "description": "<p>The <strong>Executive Director, Therapeutics Marketing</strong> is a seasoned marketing expert responsible for developing and implementing a clear, rationalized and aligned promotional strategy for DAXXIFY in CD that differentiates our brand, optimizes adoption, advances our value proposition towards increasingly personalized and digitally-enabled solutions, and develops underlying capabilities for strategic advantage and growth. This role defines a systematic engagement plan for priority customer segments (HCP, patient, and 3<sup>rd</sup> party payer audiences) that integrates and balances face-to-face vis-a-vis virtual/digital audience interactions aligned with customers’ individual preferences for interacting with industry, shapes omnichannel go-to-market priorities, ensures robust responsiveness to customer needs, and drives resource utilization efficiency.</p>\n<p>To support and inform the strategy, the Executive Director develops an efficient portfolio of customer insights and analytics that</p>\n<ul style=\"\">\n<li style=\"\">includes an understanding of how different strategic customer segments acquire information;</li>\n<li style=\"\">discovers the moments that matter most in the customer adoption journey;</li>\n<li style=\"\">defines the key milestones and pain points that impact DAXXIFY purchases.</li>\n</ul>\n<p>In collaboration with key internal stakeholders, develops sustainable and effective data collection and synthesis capabilities that rapidly generate insights that optimize our ability to get the right message on the right target at the right time. As an expert on evolution of the biopharmaceutical - key customer interaction landscape, recommends processes and content that advances understanding and awareness of internal colleagues.</p>\n<p>Works cross-functionally with key Therapeutics stakeholders to ensure an appropriate level of input is incorporated into marketing strategies and tactics, and that those plans are integrated with and aligned to the Therapeutics franchise strategy.</p>\n<p>Serves as a core member of the Therapeutics leadership team, contributing to the development and execution of the group’s vision and influencing key decisions. Delivers performance vs. annual operating plans with planned resources. Plays a key role in attracting and retaining innovative, agile talent in own department as well as across the broader commercial platform. Represents Therapeutics in the context of conferences, partnerships, key customers, company leadership meetings, and interactions with the Board of Directors.</p>\n<p>Reporting to:     General Mgr, Therapeutics</p>\n<p>Location:          Hybrid from Nashville, TN; remote from other locations</p>\n<p>Salary Range:  $195,000 - $280,000</p>\n<p>Responsibilities/Essential Duties:</p>\n<ul style=\"\">\n<li style=\"\">Lead the development of successful marketing strategies and tactics including the incorporation of new forms of engagement/business models/data-driven decision-making where appropriate; can create/envision new possibilities and translate into concrete operational plans.</li>\n<li style=\"\">Operate effectively in a ‘roll up your sleeves’ entrepreneurial environment and become rapidly conversant with the company’s platforms, product(s), and markets.</li>\n<li style=\"\">A solid understanding of the healthcare ecosystem; has a point of view on the evolving business model, benchmarks, trends, and emerging commercial capabilities that drive competitive differentiation.</li>\n<li style=\"\">A strategic vision and commercial acumen, with the ability to bring a fresh approach and new thinking along with a continuous improvement mentality.</li>\n<li style=\"\">The agility to search and respond to drivers of change, challenge the status quo, turn data into insights, insights into actions, mobilize resources, and learn with an open mind.</li>\n<li style=\"\">Demonstrated leadership, highly collaborative, a persuasive communicator with a strong executive presence that inspires confidence, works well in matrixed environments, resilient.</li>\n<li style=\"\">Passionate about the company’s technologies and benefits to patients.</li>\n<li style=\"\">Honesty, integrity, and a demonstrated ability to earn trust from colleagues and customers</li>\n</ul>\n<p><strong>Basic Qualifications</strong></p>\n<p></p>\n<ul style=\"\">\n<li style=\"\">Master’s degree &amp; 8+ years of Marketing experience</li>\n</ul>\n<p>           OR</p>\n<ul style=\"\">\n<li style=\"\">Bachelor’s degree &amp; 10+ years of Marketing experience</li>\n</ul>\n<p><strong>Preferred Qualifications</strong></p>\n<ul style=\"\">\n<li style=\"\">Strong track record of commercial success in the biotechnology, pharmaceutical or medical device industries; including 8+ years brand management/marketing experience</li>\n<li style=\"\">10+ years total commercial leadership experience</li>\n<li style=\"\">Experience with physician-administered therapeutics</li>\n<li style=\"\">Marketing/launch experience in neurology</li>\n</ul>\n<p></p>\n<p><strong> </strong><strong>Company Summary:</strong></p>\n<p>As a commercial-stage biotechnology company focused on innovative aesthetic and therapeutic offerings, Revance is setting the new standard for its clients through disruptive products, and for its employees through industry-leading benefits, which promote financial and physical well-being for all. It’s time to rethink everything you thought an employee experience could be.</p>\n<p><strong><br>What Revance invests in you:</strong></p>\n<ul style=\"\">\n<li style=\"\">Competitive Compensation including base salary, annual target bonus, and new hire equity</li>\n<li style=\"\">Flexible unlimited PTO, summer &amp; winter shutdowns, and 12 weeks’ parental leave</li>\n<li style=\"\">Generous healthcare benefits (Company pays up to 90% of premiums for medical benefits), Employer HSA contribution, 401k match, ESPP program with 15% discount on RVNC stock, tuition reimbursement, wellness discounts and much more</li>\n</ul>\n<p><strong> </strong>This section of the job description is required by the American with Disability Act (ADA). The ADA requires that job descriptions reflect the physical and mental demands required to effectively perform the essential duties of the job. The ADA prohibits employers from discriminating against a “qualified individual with a disability” in all aspects of the employment relationship. A “qualified individual with a disability” is “an individual who meets the education, experience, skill, and other job-related requirements of a position held or desired, and who, with reasonable accommodation, can perform the essential functions of a specified job.” </p>\n<p>We are an equal opportunity employer. We are a company where diverse backgrounds, experience and viewpoints are valued. Revance does not discriminate in practices or employment opportunities on the basis of an individual’s race, color, national or ethnic origin, religion, age sex, gender, sexual orientation, marital status, veteran status, disability, or any other prohibited category set forth in federal or state regulations.</p><img src=\"https://remotive.com/job/track/1928595/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1928596,
    "url": "https://remotive.com/remote-jobs/marketing/senior-product-marketing-manager-1928596",
    "title": "Senior Product Marketing Manager",
    "company_name": "Canva",
    "company_logo": "https://remotive.com/job/1928596/logo",
    "category": "Marketing",
    "tags": [
    "product marketing",
    "market research"
    ],
    "job_type": "full_time",
    "publication_date": "2024-08-07T00:51:17",
    "candidate_required_location": "USA",
    "salary": "$149,000 - $230,000",
    "description": "<br><br><div class=\"h3\">Company Description</div><br><br><div class=\"h3\">Job Description</div><p><strong>Join the team redefining how the world experiences design.</strong></p><p>Hello, g'day, mabuhay, kia ora, 你好, hallo, vítejte!</p><p>Thanks for stopping by. We know job hunting can be a little time consuming and you're probably keen to find out what's on offer, so we'll get straight to the point.</p><p><strong>Where and how you can work</strong></p><p>Our flagship office is in Sydney, Australia, but we've made our way from down under, to a hub in San Francisco, which is now home to our US operations. We offer flexibility in how and where you work. We trust our Canvanauts to choose the balance that empowers them and their team to achieve their goals.</p><p><strong>What you’d be doing in this role</strong></p><p>As Canva scales change continues to be part of our DNA. But we like to think that's all part of the fun. So this will give you the flavour of the type of things you'll be working on when you start, but this will likely evolve.</p><p>At the moment, this role is focused on:</p><ul style=\"\"><li style=\"\"><strong>Go-to-Market Strategy:</strong> Develop and execute go-to-market strategies for new product launches, ensuring alignment with overall business objectives.</li><li style=\"\"><strong>Market Research &amp; Analysis: </strong>Conduct customer, market, and competitive research to identify customer needs, market trends, and opportunities for growth.</li><li style=\"\"><strong>Product Influence:</strong> Influence the product roadmap by providing market insights and feedback from customers to the product management team, ensuring that product development aligns with market demands and opportunities.</li><li style=\"\"><strong>Cross-Functional Collaboration:</strong> Collaborate with cross-functional teams including Product, Marketing, Sales, and Customer Success to ensure alignment across business goals</li><li style=\"\"><strong>Messaging &amp; Positioning:</strong> Own the development and maintenance of compelling messaging and positioning, ensuring consistency across all channels and materials.</li><li style=\"\"><strong>Content Development:</strong> Lead / support the creation of high-impact marketing collateral, including white papers, case studies, product videos, webinars, and sales enablement tools.</li><li style=\"\"><strong>Strategic Enablement:</strong> Work with Marketing, Sales, and Customer Success to ensure our internal teams are enabled and that content reaches the right audiences.</li></ul><p><strong>You're probably a match if</strong></p><ul style=\"\"><li style=\"\">You have 5+ years of product marketing or solutions marketing experience. Note that because this is a senior role, prior direct experience is required.</li><li style=\"\">You may have prior experience in business consulting, product management, or marketing, which is a plus but not a necessity.</li><li style=\"\">You have demonstrated success in developing and executing GTM strategies for B2B SaaS products.</li><li style=\"\">You possess exceptional communication skills, with the ability to translate technical features into benefits for a wide audience.</li><li style=\"\">You can build strong cross-functional relationships with stakeholders.</li><li style=\"\">You can understand and identify trends in the market, our competitors, and our user needs across multiple segments.</li><li style=\"\">You can juggle multiple projects at once and have strong prioritization skills.</li><li style=\"\">You have a growth mindset and are eager to learn and grow every day. Given that Canva is growing 130% YoY, you are someone who’s aware that you’ll be growing and trying new things every day, and you are comfortable with ambiguity and having to forge your own path.</li><li style=\"\">You love creating customer value and solving problems!</li></ul><p><strong>About the team</strong></p><p>The product marketing team is on a mission to empower our Canva community to achieve their goals through Canva’s world-class products and tools. We do this by helping bring our new products to market and drive continuous engagement and adoption across our array of existing products. We want every person to discover how Canva can help them on a daily basis whether through creating social graphics, building impactful presentations, educating our future generations or printing gifts for your friends, with Canva everyone can achieve their goals.</p><p><strong>What's in it for you?</strong></p><p>Achieving our crazy big goals motivates us to work hard - and we do - but you'll experience lots of moments of magic, connectivity and fun woven throughout life at Canva, too. We also offer a range of benefits to set you up for every success in and outside of work.</p><p>Here's a taste of what's on offer:</p><ul style=\"\"><li style=\"\">Equity packages - we want our success to be yours too</li><li style=\"\">Health benefits plans to support you and your wellbeing</li><li style=\"\">401(k) retirement plan with company contribution</li><li style=\"\">Inclusive parental leave policy that supports all parents &amp; carers</li><li style=\"\">An annual Vibe &amp; Thrive allowance to support your wellbeing, social connection, office setup &amp; more</li><li style=\"\">Flexible leave options that empower you to be a force for good, take time to recharge and supports you personally</li></ul><p>Check out lifeatcanva.com for more info.</p><p>At Canva we value fairness, and we strive to provide competitive, market-informed compensation whilst ensuring internal equity within the team in each region. We make hiring decisions based on your skills, experience and our overall assessment of what we observed and learnt in the hiring process. The target salary range for this position is <strong>$149,000 - $230,000</strong>. When calculating offers, we make salary decisions based on market data and candidates' skills and experience.</p><p><strong>Other stuff to know</strong></p><p>We make hiring decisions based on your experience, skills and passion, as well as how you can enhance Canva and our culture. When you apply, please tell us the pronouns you use and any reasonable adjustments you may need during the interview process.</p><p>We celebrate all types of skills and backgrounds at Canva so even if you don’t feel like your skills quite match what’s listed above - we still want to hear from you!</p><p>Please note that interviews are conducted virtually.</p><br><br><div class=\"h3\">Qualifications</div><br><br><div class=\"h3\">Additional Information</div><img src=\"https://remotive.com/job/track/1928596/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1928597,
    "url": "https://remotive.com/remote-jobs/marketing/social-executive-1928597",
    "title": "Social Executive",
    "company_name": "Tactical",
    "company_logo": "https://remotive.com/job/1928597/logo",
    "category": "Marketing",
    "tags": [
    "social media"
    ],
    "job_type": "full_time",
    "publication_date": "2024-08-06T22:50:20",
    "candidate_required_location": "Western Asia (Middle East)",
    "salary": "",
    "description": "<div><span style=\"font-size: 16px\">We're on the lookout for a Social Executive to join our awesome Social team, managing a variety of brands across MENA. This is an exciting opportunity to work with and learn from a world-class social team who are customer-obsessed, insist on the highest of standards and think big.</span></div><div><br></div><div><b style=\"font-size: 16px\">Who You Are</b></div><div><br></div><div><span style=\"font-size: 16px\">You're a creative thinker and self-starter who's eager to learn how to read data, connect with our customers and grow in a supportive environment. You’re passionate, self-motivated, innovative and take pride in your work.</span></div><div><br></div><div><span style=\"font-size: 16px\">You should have a strong understanding of social media platforms, love memes and have a knack for recognising emerging trends and opportunities.</span></div><br><br><div class=\"h3\">Responsibilities</div><li style=\"\">Create and schedule social media content across social platforms such as Instagram, Facebook, YouTube &amp; TikTok</li><li style=\"\">Support on creating monthly social media content calendars </li><li style=\"\">Social copywriting in both English and Arabic, including creative copy for post captions as well as captions for paid social ads</li><li style=\"\">Identify trends and content opportunities that are relevant to AE, EG and SA audiences on social media that we can jump on</li><li style=\"\">Monitor trending news &amp; topics across social media channels relevant to the entertainment and retail industry</li><li style=\"\">Research content ideas and best-in-class social references from similar brands / competitors or out of category brands</li><li style=\"\">Come up with engaging social content ideas that will resonate our community</li><li style=\"\">Engage and respond to our community comments across channels to generate conversation and drive brand love</li><li style=\"\">Analyse page &amp; post performance and be able to recommend ways to improve our organic numbers</li><li style=\"\">Support social media manager on reportingAttend internal &amp; external weekly status calls with the wider team </li><br><br><div class=\"h3\">Experience &amp; Competencies</div><li style=\"\">2-3 years of social media experience, preferable agency side</li><li style=\"\">Exceptional written and verbal communication skills in both English and Arabic</li><li style=\"\">You're collaborative, with solid attention to detail (no typo goes unmissed)Y</li><li style=\"\">ou’ve got an excellent understanding of the social media landscape in the MENA region (specifically SA, EG and AE) and channel best practice, especially on Instagram &amp; TikTok</li><li style=\"\">You have your finger on the pulse on all things trending cross platforms</li><li style=\"\">You’re an avid user of TikTok</li><li style=\"\">Good understanding of social media metrics and KPIs</li><li style=\"\">Proactive, self-motivated and always striving for excellence</li><li style=\"\">Curious &amp; eager to learn</li><li style=\"\">You take ownership of your tasks and never miss a deadline</li><li style=\"\">You respond well to feedback and actively seek to improve the quality of your work</li><div><span style=\"font-size: 16px\">Please reach out to us if you feel this role suits you and your development needs. We champion people and kick-ass work. We’re always interested in meeting new people, hearing their story and being challenged.</span></div><div><br></div><div><span style=\"font-size: 16px\">Click the link to apply, tell us about yourself and let’s chat 👇</span></div><img src=\"https://remotive.com/job/track/1928597/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1928752,
    "url": "https://remotive.com/remote-jobs/marketing/senior-staff-regional-marketing-specialist-1928752",
    "title": "Senior Staff Regional Marketing Specialist",
    "company_name": "Renesas Electronics",
    "company_logo": "https://remotive.com/job/1928752/logo",
    "category": "Marketing",
    "tags": [
    "agile",
    "research",
    "market research",
    "IoT",
    "infrastructure",
    "diversity"
    ],
    "job_type": "full_time",
    "publication_date": "2024-08-06T08:50:52",
    "candidate_required_location": "Europe",
    "salary": "",
    "description": "<p><br><br></p>\n<div class=\"h3\">Company Description</div>\n<p>Renesas is one of the top global semiconductor companies in the world. We strive to develop a safer, healthier, greener, and smarter world, and our goal is to make every endpoint intelligent by offering product solutions in the automotive, industrial, infrastructure and IoT markets. Our robust product portfolio includes world-leading MCUs, SoCs, analog and power products, plus Winning Combination solutions that curate these complementary products. We are a key supplier to the world’s leading manufacturers of electronics you rely on every day; you may not see our products, but they are all around you.  </p>\n<p><br><br></p>\n<div class=\"h3\">Job Description</div>\n<p>We are looking for a highly skilled and motivated Automotive MCU Marketing Staff Specialist to join our team and drive our market presence in the automotive industry in Europe.</p>\n<p>Key responsibilities:</p>\n<ul style=\"\">\n<li style=\"\">Develop and implement marketing strategies for automotive MCU products in Europe aligning with business objectives</li>\n<li style=\"\">Define product positioning and compelling messaging for target segments and customers</li>\n<li style=\"\">Lead efforts to secure design wins in collaboration with sales and FAEs. Build strong relationships with key customers and partners</li>\n<li style=\"\">Collaborate with engineering, sales, and product teams for effective marketing and successful product promotions</li>\n<li style=\"\">Provide sales teams with the necessary marketing tools and support to enhance their efforts and meet sales targets</li>\n<li style=\"\">Conduct market analysis, competitor research, and customer insights to identify growth opportunities and market trends</li>\n<li style=\"\">Represent the company at industry events and conferences</li>\n<li style=\"\">Monitor and analyze marketing performance metrics, providing regular reports and actionable insights to senior management</li>\n</ul>\n<p> </p>\n<p><br><br></p>\n<div class=\"h3\">Qualifications</div>\n<ul style=\"\">\n<li style=\"\">Strong knowledge of automotive MCU technologies, architectures, and applications, with a proven track record of successful marketing experience in this domain</li>\n<li style=\"\">Good understanding of Europe automotive markets (E/E architecture, ADAS, and Body), including market trends, customer needs, and regulatory requirements</li>\n<li style=\"\">Demonstrated ability to develop and execute effective marketing strategies that align with Europe automotive business objectives and drive market share growth</li>\n<li style=\"\">Strong collaboration skills to work closely with engineering, sales, and product teams to translate technical capabilities into compelling marketing messages</li>\n<li style=\"\">Proficiency in conducting market research, competitor analysis, and customer insights to identify opportunities and address market challenges effectively</li>\n<li style=\"\">Proven experience in positioning and differentiating automotive MCU products, understanding customer pain points, and communicating unique value propositions</li>\n<li style=\"\">Excellent communication and presentation abilities to effectively convey technical information to both technical and non-technical stakeholders</li>\n<li style=\"\">A results-oriented mindset with a focus on achieving measurable marketing goals and objectives<br><br><strong><u>Requirements</u></strong><br><br>Bachelor’s degree in engineering or related fields and 5+ years of related professional experience. Master’s degree in Engineering, or BSEE with MBA with 3+ years of experience.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Additional Information</div>\n<div> </div>\n<p>Renesas Electronics Corporation empowers a safer, smarter and more sustainable future where technology helps make our lives easier. The leading global provider of microcontrollers, Renesas combines our expertise in embedded processing, analog, power and connectivity to deliver complete semiconductor solutions. These Winning Combinations accelerate time to market for automotive, industrial, infrastructure and IoT applications, enabling billions of connected, intelligent devices that enhance the way people work and live. Learn more at <a href=\"http://www.renesas.com\" rel=\"nofollow\">www.renesas.com</a>. </p>\n<p>Renesas’ mission, To Make Our Lives Easier, is underpinned by our company culture, TAGIE. TAGIE stands for Transparent, Agile, Global, Innovative and Entrepreneurial. Our goal is to embed this unique culture in everything we do to succeed as a company and create trust with our diverse colleagues, customers and stakeholders.</p>\n<p>Renesas Electronics is an equal opportunity and affirmative action employer, committed to  supporting diversity and fostering a work environment free of discrimination on the basis of sex, race, religion, national origin, gender, gender identity, gender expression, age, sexual orientation, military status, veteran status, or any other basis protected by law. For more information, please read our <a href=\"https://www.renesas.com/kr/en/about/company/sustainability/diversity\" rel=\"nofollow\">Diversity &amp; Inclusion Statement</a>.</p>\n<img src=\"https://remotive.com/job/track/1928752/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1928044,
    "url": "https://remotive.com/remote-jobs/marketing/director-of-demand-generation-1928044",
    "title": "Director of Demand Generation",
    "company_name": "Appcues",
    "company_logo": "https://remotive.com/job/1928044/logo",
    "category": "Marketing",
    "tags": [
    "demand generation",
    "team management",
    "performance marketing"
    ],
    "job_type": "full_time",
    "publication_date": "2024-08-06T00:50:49",
    "candidate_required_location": "USA",
    "salary": "",
    "description": "<div><span style=\"font-size: 10pt\">The opportunity in front of us is </span><b style=\"font-size: 10pt\">massive</b><span style=\"font-size: 10pt\">. Our market is growing, fast. We’re a leader in our category. Our customer base is loaded with aspirational logos and vocal advocates, and our content attracts hundreds of thousands of visitors a month. If that gets you really f@*#ing excited, this post is for you.</span></div><div><br></div><div><span style=\"font-size: 10pt\">Appcues is looking for a Director of Demand Generation to grab that opportunity by the horns and build a customer acquisition machine. We’re looking for a leader who craves ownership and obsesses over results. A data-driven, strategic operator with a move-fast, get-shit-done style of execution. </span></div><div><br></div><div><span style=\"font-size: 10pt\">Appcues’ Director of Demand Generation will define the strategic vision for Appcues demand generation function,with direct responsibility for our lead conversion funnel and all paid and organic channels channels (existing and new ones you identify as potential growth drivers), managing a substantial budget, while continuously optimizing for CAC and LTV.</span></div><br><br><div class=\"h3\">About the role</div><li style=\"\">Own and manage to lead and pipeline targets in service of new business and expansion revenue targets. You’ll use every tool at your disposal to optimize conversion throughout the funnel, from reach to free trial starts and deal acceleration. </li><li style=\"\">Manage strategy, execution, and optimization of all paid and organic demand generation programs including performance marketing, content, account-based marketing (ABM), conversion rate optimization, events (in-person and virtual), and sponsorships.</li><li style=\"\">Manage a team of program specialists, external vendors, and budget to accomplish goals.</li><li style=\"\">Establish a culture of testing and experimentation while driving to a long-term strategy. Monitor demand gen trends and regularly test new programs, tactics, partners, channels, etc to boost customer acquisition.</li><li style=\"\">Partner with our content team to optimize paid and owned content distribution and nurture prospects throughout the acquisition funnel. Partner with our creative and product marketing teams to optimize and test creative assets, value propositions, landing pages, and email/ad copy.</li><li style=\"\">Partner closely with sales and business development on campaign follow-up, outreach strategies, and ABM initiatives.</li><li style=\"\">Forecast, measure, and report on the impact of demand activities on leads, pipeline, and revenue.</li><br><br><div class=\"h3\">About You</div><li style=\"\">You thrive on owning and beating ambitious goals. We need to double lead and pipeline growth over the next 12 months. Are you up for the challenge?</li><li style=\"\">You’re always learning. You fail fast, iterate quickly, and have a history of solving tough problems with innovative solutions.</li><li style=\"\">You’re excited about (and have plenty of experience with) product-led growth. We’re champions of the movement and practitioners ourselves. Appcues’ self-serve free trial has helped us land new customers from rapid-growth startups to the Fortune 500. </li><li style=\"\">You’re a natural leader. You’ll help establish a culture of experimentation within our marketing team and across the organization. Our team is super collaborative, stacked with talent, and ready to rally behind you.</li><li style=\"\">You balance strategic, long-term thinking with a move-fast, get-shit-done style of execution. </li><li style=\"\">You’ve got strong analytical and quantitative skills. No doubt, this is a data-driven role. </li><li style=\"\">You’ve scaled paid and organic acquisition programs and results at and beyond our stage of business.</li><li style=\"\">You have experience managing people, agencies, vendors, and budgets. </li><img src=\"https://remotive.com/job/track/1928044/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1926938,
    "url": "https://remotive.com/remote-jobs/marketing/manager-lifecycle-marketing-1926938",
    "title": "Manager, Lifecycle Marketing",
    "company_name": "Pomelocare",
    "company_logo": "https://remotive.com/job/1926938/logo",
    "category": "Marketing",
    "tags": [
    "CRM",
    "A/B Testing",
    "marketing automation"
    ],
    "job_type": "full_time",
    "publication_date": "2024-08-05T20:51:02",
    "candidate_required_location": "USA",
    "salary": "$105,000-$125,000",
    "description": "<div class='\"content-intro\"'><div class=\"h3\"><span style='\"font-family:'>About us</span></div>\n<p><span style='\"font-family:'><a href=\"%22http://www.pomelocare.com%22\" rel=\"nofollow\"><span style='\"font-weight:'>Pomelo Care</span></a><span style='\"font-weight:'> is a multi-disciplinary team of clinicians, engineers and problem solvers who are passionate about improving care for moms and babies. We are transforming outcomes for pregnant people and babies with evidence-based pregnancy and newborn care at scale. Our technology-driven care platform enables us to engage patients early, conduct individualized risk assessments for poor pregnancy outcomes, and deliver coordinated, personalized virtual care throughout pregnancy, NICU stays, and the first postpartum year. We measure ourselves by reductions in preterm births, NICU admissions, c-sections and maternal mortality; we improve outcomes and reduce healthcare spend.</span></span></p></div><div class=\"h3\"><span style='\"font-weight:'>Role Description</span></div>\n<p><strong>Your North Star</strong>: Optimize our patient enrollment funnel to increase our enrollment rate.</p>\n<p>In this role, you will execute, and optimize end-to-end, omnichannel marketing strategies  to drive patient enrollment and retention. You will be responsible for defining segmentation strategies, building and optimizing patient marketing  journeys and campaigns using multivariate A/B tests, and measuring performance. This role is ideal for someone with B2B2C marketing experience who has previously served in roles supporting lifecycle marketing for high growth healthcare start-ups.</p>\n<div class=\"h3\"><span style='\"font-weight:'>Responsibilities</span></div>\n<ul style=\"\">\n<li style=\"\">Manage  end-to-end, multi-channel enrollment campaigns (e.g., e-mail, direct mail, SMS, paid media) developing efficiencies and automations that allow for personalization and improve performance.</li>\n<li style=\"\">Define, scope, and prioritize A/B tests to optimize enrollment funnel performance and improve retention.</li>\n<li style=\"\">Develop reports and dashboards in collaboration with the Data team to track and measure patient funnel and campaign performance to identify opportunities to increase enrollment rate, decrease time to conversion, and improve retention.  </li>\n<li style=\"\">Manage marketing implementations for new launches including creating marketing materials and managing the approvals process with partners.</li>\n<li style=\"\">Collaborate closely with the Marketing, Customer Success, Outreach, and Clinical teams to ensure we are delivering on contract requirements, the client’s needs, Pomelo’s ability to deliver care, and adjust our marketing campaigns and strategy accordingly. </li>\n<li style=\"\">Manage relationships with external agencies and vendors as needed, ensuring timely and high-quality deliverables.</li>\n<li style=\"\">Ensure compliance and best practices with CAN-SPAM, TCPA, HIPAA, and other applicable laws. </li>\n</ul>\n<div class=\"h3\"><span style='\"font-weight:'>Who you are</span></div>\n<ul style=\"\">\n<li style=\"\">4+ years of experience in B2B2C lifecycle, growth, or email marketing at a high growth startup</li>\n<li style=\"\">Strong analytical skills, a sharp attention to detail, and experience running A/B tests to drive performance.</li>\n<li style=\"\">Comfortable with ambiguity and thrive in fast paced environments.</li>\n<li style=\"\">Creative, scrappy, and willing to wear many hats.</li>\n<li style=\"\">Knowledge of marketing automation platforms and CRMs (e.g. Customerio, Salesforce).</li>\n</ul>\n<div class=\"h3\"><strong>Why you should join our team</strong></div>\n<p>By joining Pomelo, you will get in on the ground floor of a fast-moving, well-funded, and mission-driven startup where you will have a profound impact on the patients we serve. And you'll learn, grow, be challenged, and have fun with your team while doing it.</p>\n<p>We strive to create an environment where employees from all backgrounds are respected. We value working across disciplines, moving fast, data-driven decision making, learning, and always putting the patient first. We also offer:</p>\n<ul style=\"\">\n<li style=\"\">Competitive healthcare benefits</li>\n<li style=\"\">Generous equity compensation</li>\n<li style=\"\">Unlimited vacation</li>\n<li style=\"\">Membership in the First Round Network (a curated and confidential community with events, guides, thousands of Q&amp;A questions, and opportunities for 1-1 mentorship)</li>\n</ul>\n<p>At Pomelo, we are committed to hiring the best team to improve outcomes for all mothers and babies, regardless of their background. We need diverse perspectives to reflect the diversity of problems we face and the population we serve. We look to hire people from a variety of backgrounds, including but not limited to race, age, sexual orientation, gender identity and expression, national origin, religion, disability, and veteran status.</p>\n<p>Our salary ranges are based on paying competitively for our company’s size and industry, and are one part of the total compensation package that also includes equity, benefits, and other opportunities at Pomelo Care. In accordance with New York City, Colorado, California, and other applicable laws, Pomelo Care is required to provide a reasonable estimate of the compensation range for this role. Individual pay decisions are ultimately based on a number of factors, including qualifications for the role, experience level, skillset, geography, and balancing internal equity. A reasonable estimate of the current salary range is<strong><em> $105,000-$125,000.</em></strong> We expect most candidates to fall in the middle of the range. We also believe that your personal needs and preferences should be taken into consideration, so we allow some choice between equity and cash.</p><img src=\"https://remotive.com/job/track/1926938/blank.gif?source=public_api\" alt=\"\"/>"
    },
    {
    "id": 1924705,
    "url": "https://remotive.com/remote-jobs/marketing/generative-ai-content-creator-1924705",
    "title": "Generative AI Content Creator",
    "company_name": "Contra",
    "company_logo": "https://remotive.com/job/1924705/logo",
    "category": "Marketing",
    "tags": [
    "social media",
    "video",
    "AI/ML"
    ],
    "job_type": "part_time",
    "publication_date": "2024-07-16T18:00:01",
    "candidate_required_location": "Worldwide",
    "salary": "$60 - $80/hr ",
    "description": "<p>Contra is seeking a part-time Generative AI Content Creator to join our team. This role is perfect for someone passionate about AI and content creation who wants to make a significant impact in a flexible work environment.</p>\n<p> </p>\n<p><strong>*The is a part-time contract for ~20 hours / week. </strong></p>\n<p><strong> </strong></p>\n<div class=\"h3\" id=\"a91408fb-b4bf-48dd-a0bd-97131d3d92e0\">Responsibilities:</div>\n<ul class=\"_listContainer_1wyhh_1\" style=\"\">\n<li style=\"\">Generate Video Content: Use AI tools to create engaging video content for social media, blogs, and our website.</li>\n<li style=\"\">Ensure AI Consistency: Align AI-generated video content with brand guidelines and marketing goals.</li>\n<li style=\"\">Stay Current: Keep up with the latest trends in AI and video content creation.</li>\n<li style=\"\">Analyze Results: Track and analyze the performance of AI video content, making adjustments to boost engagement.</li>\n<li style=\"\">Collaborate with Teams: Work with marketing, product, and design teams to integrate AI-generated video content into campaigns.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1924705/blank.gif?source=public_api\" alt=\"\"/>",
    "company_logo_url": "https://remotive.com/job/1924705/logo"
    },
    {
    "id": 1924707,
    "url": "https://remotive.com/remote-jobs/marketing/ugc-content-creator-1924707",
    "title": "UGC Content Creator",
    "company_name": "Contra",
    "company_logo": "https://remotive.com/job/1924707/logo",
    "category": "Marketing",
    "tags": [
    "social media"
    ],
    "job_type": "part_time",
    "publication_date": "2024-07-16T17:58:57",
    "candidate_required_location": "Worldwide",
    "salary": "$60 - $80/hr ",
    "description": "<p>We are seeking a motivated and creative Part-Time UGC Content Creator to join our team. You'll produce high-quality content that aligns with our brand and engages our audience.</p>\n<p> </p>\n<div class=\"h4\" id=\"f18cf8d0-6138-4cdc-89ea-3d7582c88bca\">Responsibilities:</div>\n<ul class=\"_listContainer_1wyhh_1\" style=\"\">\n<li style=\"\">Create engaging content for social media, blogs, and our website.</li>\n<li style=\"\">Collaborate with marketing, design, and product teams.</li>\n<li style=\"\">Monitor and analyze content performance to improve engagement.</li>\n<li style=\"\">Stay updated on industry trends and best practices.</li>\n<li style=\"\">Ensure all content is high-quality and error-free.</li>\n<li style=\"\">Contribute innovative ideas for content strategies and campaigns.</li>\n<li style=\"\">Engage with our community through comments and messages.</li>\n<li style=\"\">Manage a content calendar for timely publications.</li>\n<li style=\"\">Assist in creating multimedia content like videos and graphics.</li>\n<li style=\"\">Provide feedback for continuous improvement.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1924707/blank.gif?source=public_api\" alt=\"\"/>",
    "company_logo_url": "https://remotive.com/job/1924707/logo"
    },
    {
    "id": 1924703,
    "url": "https://remotive.com/remote-jobs/marketing/marketing-strategist-1924703",
    "title": "Marketing Strategist",
    "company_name": "Contra",
    "company_logo": "https://remotive.com/job/1924703/logo",
    "category": "Marketing",
    "tags": [
    "social media",
    "research",
    "market research",
    "customer acquisition",
    "analytics"
    ],
    "job_type": "part_time",
    "publication_date": "2024-07-16T17:57:15",
    "candidate_required_location": "Worldwide",
    "salary": "$75 - $100/hr",
    "description": "<p>We are looking for a <strong>Part Time</strong> <strong>Marketing Strategist</strong> to partner on projects with the Contra team. You will play a role in developing and executing comprehensive marketing strategies to enhance brand awareness, drive customer acquisition, and maximize revenue growth. You will collaborate closely with cross-functional teams to analyze market trends, identify target audiences, and devise innovative campaigns that resonate with our customers.</p>\n<p> </p>\n<p> </p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul class=\"_listContainer_1wyhh_1\" style=\"\">\n<li style=\"\"><strong>Strategic Planning</strong>: Develop and refine marketing strategies that align with our business objectives and resonate with our target audience.</li>\n<li style=\"\"><strong>Market Research</strong>: Conduct in-depth market research and competitor analysis to identify key trends, opportunities, and challenges.</li>\n<li style=\"\"><strong>Campaign Execution</strong>: Lead the execution of marketing campaigns across various channels, including digital, social media, email, and events, ensuring seamless implementation and timely delivery.</li>\n<li style=\"\"><strong>Content Creation</strong>: Work closely with the creative team to develop compelling long and short form content (ex. social media copy, thought leadership pieces, blog articles, etc.) and creative assets that engage our audience and drive action.</li>\n<li style=\"\"><strong>Data-Driven Optimization</strong>: Utilize data analytics tools to track and measure campaign performance, identify areas for improvement, and optimize strategies for maximum impact.</li>\n<li style=\"\"><strong>Cross-Functional Collaboration</strong>: Collaborate with internal teams, including sales, product, and design, to ensure alignment and integration of marketing efforts across the organization.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1924703/blank.gif?source=public_api\" alt=\"\"/>",
    "company_logo_url": "https://remotive.com/job/1924703/logo"
    },
    {
    "id": 1924459,
    "url": "https://remotive.com/remote-jobs/marketing/communication-specialist-1924459",
    "title": "Communication Specialist",
    "company_name": "WP Media",
    "company_logo": "https://remotive.com/job/1924459/logo",
    "category": "Marketing",
    "tags": [
    "excel",
    "social media",
    "wordpress",
    "SOLID",
    "performance optimization"
    ],
    "job_type": "full_time",
    "publication_date": "2024-07-15T14:12:53",
    "candidate_required_location": "Americas, EMEA, UK",
    "salary": "",
    "description": "<p>Do you enjoy working with different teams to gather insights and share company news? Are you passionate about crafting engaging messages for various channels and building a strong social media strategy? Do you like writing compelling newsletters and blog posts that keep everyone informed?</p>\n<p>If you answered yes to these questions, we are sure this position will sound super exciting to you. 🤩</p>\n<p>We are looking for a friendly person in love with words and communication to take care of our products: <a href=\"https://wp-rocket.me/\" rel=\"nofollow\" target=\"_self\">WP Rocket</a>, <a href=\"https://imagify.io/\" rel=\"nofollow\" target=\"_self\">Imagify</a>, <a href=\"https://rocketcdn.me\" rel=\"nofollow\" target=\"_self\">RocketCDN</a> (and maybe more!) 🚀</p>\n<p>Keep reading for more details! 📝</p>\n<p> </p>\n<div class=\"h3\">Become Our New Communication Specialist!</div>\n<p> </p>\n<p>In your job as a <strong>Communication Specialist</strong>, you will be communicating across all channels (website, social media, email,...).</p>\n<p>In this role, you will report directly to the VP of Marketing and contribute significantly to driving the company’s success by building and growing best-in-class communication.</p>\n<p>For this position, it’s essential to be <strong>perfectly fluent in English</strong>. Since we also communicate in French, it would be a <strong>nice plus</strong> if you are able to effectively and professionally write in French.</p>\n<p>You will join our Marketing team. <strong>We work remotely</strong>, and ideally you should live in a time zone between GMT+3 to GMT-5. We are so curious to know which new country will be added to our distributed team map! 🌍</p>\n<p> </p>\n<div class=\"h3\">What You Will Be Doing:</div>\n<p> </p>\n<p>In your everyday job as a <strong>Communication Specialist</strong>, you should first enjoy our products! You will write and craft consistent communication to <strong>develop brand awareness, visibility, and engagement</strong>.</p>\n<p><br>Here is a list describing the tasks involved in this position <em>(do you happen to like making lists? So do we!)</em>: </p>\n<ul style=\"\">\n<li style=\"\">You will <strong>grow and develop our brands</strong>, giving it more character and depth every day so that all customers find it loveable. </li>\n<li style=\"\">You will <strong>collaborate</strong> with the marketing team and other departments to get insights and share news about what’s happening in the company, </li>\n<li style=\"\">You will create <strong>consistent and desirable messages</strong> adapted to each communication channel (ads, emails, landing pages…)</li>\n<li style=\"\">You will build and execute a <strong>social media strategy</strong> to broaden our audience, engage with our community and drive user engagement. </li>\n<li style=\"\">You will be in charge of our <strong>newsletter</strong>, curating content ideas, crafting engaging messages, sending it to our audience, and growing our email list.</li>\n<li style=\"\">You will <strong>write blog posts</strong> about what’s happening internally (yearly review, WordCamps, team’s success…).</li>\n<li style=\"\">You will provide communication and social media <strong>activity reports</strong> and input for improvement.</li>\n</ul>\n<div class=\"h3\"> </div>\n<div class=\"h3\">What Do You Need To Excel at This Job:</div>\n<p> </p>\n<p><strong>Being yourself.</strong></p>\n<p>Our team is diverse and composed of people from all over the world. <strong>Respect, collaboration</strong>, and <strong>inclusivity</strong> are some of our core values (<em>more on this below</em>). Every day of work is an exciting opportunity to get in touch with fantastic people who will enrich your cultural and professional background.</p>\n<p> </p>\n<p><strong>Proven working experience in social media management and communication.</strong></p>\n<p>You have solid experience in social media management and communication (ideally in a start-up, a tech or a major e-commerce company), and a great understanding of marketing processes.</p>\n<p> </p>\n<p><strong>Excellent proficiency in English.</strong></p>\n<p>Your English is absolutely perfect. You write with excellent spelling, grammar and proofreading skills, while remaining accessible to a non-native English-speaking audience.</p>\n<p> </p>\n<p><strong>Communication and storytelling skills.</strong></p>\n<p>You can communicate openly with people, and modulate your writing tone according to the channel you write for. Your communication is friendly and engaging, even when you write about very technical topics.</p>\n<p> </p>\n<p><strong>Creative thinking and innovation.</strong></p>\n<p>You are able to think outside the box, generate innovative ideas, and develop unique content that captures our audience’s attention. Your ability to craft compelling stories and visually engaging posts will set our communication apart and drive our brand forward.</p>\n<p> </p>\n<p><strong>Organization and multitasking skills.</strong></p>\n<p>You can juggle different tasks but also ask for help when needed. The team will always be at your side to support you in case of doubt, and to spend happy moments exchanging funny animated GIFs!</p>\n<p> </p>\n<p><strong>Positive attitude, detail and customer-oriented.</strong></p>\n<p>You define yourself as a positive and proactive person. You like to experiment and also maintain your actions customer-focused.</p>\n<p> </p>\n<p><em>Do you want to know three other things we appreciate about our candidates?</em></p>\n<ul style=\"\">\n<li style=\"\"><strong>Previous remote job experience.<br></strong>Slack will be your virtual office, where all the life of the company takes place.</li>\n<li style=\"\"><strong>Knowing the basics of web performance. <br></strong>We will train you for this, and we will always have your back, don't worry! But if you already have experience with web performance optimization, let us know. 😉</li>\n<li style=\"\"><strong>The involvement in the WordPress community.<br></strong>We support our teammates to attend and/or speak at WordCamps and volunteer within the community.</li>\n</ul>\n<p> </p>\n<div class=\"h3\"> </div>\n<img src=\"https://remotive.com/job/track/1924459/blank.gif?source=public_api\" alt=\"\"/>",
    "company_logo_url": "https://remotive.com/job/1924459/logo"
    }
    ]
    }